
function GetLonLat()
{
	var lon = 0;
	    lat = 0;
		UTC = 0;
var cityName = document.getElementById("city_name");
city = cityName.options[cityName.selectedIndex].text;	

if (city == "РђР±Р°РєР°РЅ") {lat = 53.71; lon = 91.429; UTC = 7;};
if (city == "РђРґРµР»Р°РёРґР°") {lat = 138.583; lon = -34.917; UTC = 9.5;};
if (city == "РђРєС‚Р°Сѓ") {lat = 43.65; lon = 51.16; UTC = 5;};
if (city == "РђРєС‚РѕР±Рµ") {lat = 50.279; lon = 57.205; UTC = 5;};
if (city == "РђР»Р¶РёСЂ") {lat = 3.233; lon = 36.800;UTC =1;};
if (city == "РђР»РјР°С‚С‹") {lat = 43.25; lon = 76.92;UTC =6;}; 
if (city == "РђР»С‚Р°Р№") {lat = 48.30; lon = 89.51; UTC = 7;};
if (city == "РђРјСЃС‚РµСЂРґР°Рј") {lat = 4.883; lon = 52.367;UTC =2;};
if (city == "РђРЅРіР°СЂСЃРє") {lat = 52.4546; lon = 103.8195;UTC =8;};
if (city == "РђРЅРєР°СЂР°") {lat = 32.833; lon = 39.950;UTC =3;};
if (city == "РђСЂС…С‹Р·") {lat = 43.5651; lon = 41.2784;UTC =3};
if (city == "РђСЂР·Р°РјР°СЃ") {lat = 55.3800; lon = 43.8200;UTC =3;};
if (city == "РђСЂС…Р°РЅРіРµР»СЊСЃРє") {lat = 64.5401; lon = 40.5433; UTC =3;};
if (city == "РђРЅС‚РІРµСЂРїРµРЅ") {lat = 4.417; lon = 51.200;UTC =2;};
if (city == "РђСЃС‚Р°РЅР°") {lat = 51.1801 ; lon = 71.44598;UTC =6;};
if (city == "РђСЃС‚СЂР°С…Р°РЅСЊ") {lat = 46.34968; lon = 48.04076 ;UTC =4;};
if (city == "РђС‚С‹СЂР°Сѓ") {lat = 47.11; lon = 51.88; UTC = 5;}
if (city == "РђС€С…Р°Р±Р°Рґ") {lat = 50.279; lon = 57.205; UTC =5;};
if (city == "РђС„РёРЅС‹") {lat = 37.95; lon = 58.38;UTC =3;};

if (city == "Р‘Р°РіРґР°Рґ") {lat = 44.4; lon = 33.333;UTC =3;};
if (city == "Р‘Р°Р№РєР°Р»СЊСЃРє") {lat = 51.5151; lon = 104.14;UTC =8;};
if (city == "Р‘Р°РєСѓ") {lat = 40.37767; lon = 49.89201;UTC =4;};
if (city == "Р‘Р°СЂР°РЅРѕРІРёС‡Рё") {lat = 53.1327; lon = 26.0139;UTC =3;};
if (city == "Р‘Р°С‚СѓРјРё") {lat = 41.64; lon = 41.63; UTC =4;};
if (city == "Р‘Р°СЂСЃРµР»РѕРЅР°") {lat = 41.3984; lon = 2.1741;UTC =2;};
if (city == "Р‘Р°РЅРіРєРѕРє") {lat = 100.5170; lon = 13.750;UTC =4;};
if (city == "Р‘Р°СЂРЅР°СѓР»") {lat = 53.3606; lon = 83.7636;UTC =4;};
if (city == "Р‘РµР»С„Р°СЃС‚") {lat =  -5.933; lon =  54.583;UTC =0;};
if (city == "Р‘РµР»РѕСЃС‚РѕРє") {lat =53,13; lon = 23,164; UTC = 2;};
if (city == "Р‘РµСЂР»РёРЅ") {lat = 13.3; lon = 52.45;UTC =2;};
if (city == "Р‘РµР»РіРѕСЂРѕРґ") {lat = 50.61074; lon = 36.58015;UTC =3;};
if (city == "Р‘РµР»РѕРіРѕСЂСЃРє") {lat = 50.9158; lon = 128.4611;UTC =9;};
if (city == "Р‘РµР»РѕСЏСЂСЃРє") {lat = 53,44; lon = 83,90;UTC = 7;};
if (city == "Р‘РµСЂРЅ") {lat = 7.433; lon = 46.95;UTC =2;};
if (city == "Р‘РµСЂРґРёС‡РµРІ") {lat = 49.8993; lon = 28.6023;UTC =3;};
if (city == "Р‘РµСЂРґСЏРЅСЃРє") {lat = 46.7663; lon = 36.7988;UTC =3;};
if (city == "Р‘РёР№СЃРє") {lat = 52.6093; lon = 85.8640;UTC =7;};
if (city == "Р‘Р»Р°РіРѕРІРµС‰РµРЅСЃРє") {lat = 50.2833; lon = 127.7667;UTC =9;};
if (city == "Р‘РѕРіРѕС‚Р°") {lat = 74.083; lon = 4.667;UTC =-4;};
if (city == "Р‘РѕР»РѕРЅСЊСЏ") {lat = 44.4833; lon = 11.3333;UTC =2;};
if (city == "Р‘РѕСЂРґРѕ") {lat = 44.8404; lon = -0.5805;UTC =2;};
if (city == "Р‘СЂР°С‚СЃРє") {lat = 56.1325; lon = 101.6141; UTC =8;};
if (city == "Р‘СЂРЅРѕ") {lat = 49.19; lon = 16.60; UTC =2;};
if (city == "Р‘СЂСЋСЃСЃРµР»СЊ") {lat = 4.367; lon = 50.8;UTC =2;};
if (city == "Р‘СЂРµСЃС‚") {lat = 52.0975; lon = 23.6878;UTC =3;};
if (city == "Р‘СЂСЏРЅСЃРє") {lat = 53.25209; lon = 34.37167;UTC =3;};
if (city == "Р‘СѓС…Р°СЂРµСЃС‚") {lat =  26.1; lon = 44.433;UTC =3;};
if (city == "Р‘СѓРґР°РїРµС€С‚") {lat =  19.033; lon = 47.5;UTC =2;};
if (city == "Р‘СѓСЌРЅРѕСЃ-РђР№СЂРµСЃ") {lat =  -58.45; lon = -34.6;UTC =-3;};

if (city == "Р’Р°РЅРєСѓРІРµСЂ") {lat =  -123.167; lon = 49.183;UTC =-7;};
if (city == "Р’Р°С€РёРЅРіС‚РѕРЅ") {lat =  -77.033; lon = 38.9; UTC =-4;};
if (city == "Р’Р°СЂС€Р°РІР°") {lat =  20.967; lon = 52.183; UTC =2;};
if (city == "Р’РµРЅР°") {lat =  16.383; lon = 48.217; UTC =2;};
if (city == "Р’РµРЅРµС†РёСЏ") {lat = 45.4386; lon = 12.3267; UTC =2;};
if (city == "Р’РµР»РёРєРёР№ РќРѕРІРіРѕСЂРѕРґ") {lat =  58.51667; lon = 31.28333 ;UTC =3;};
if (city == "Р’РµР»Р»РёРЅРіС‚РѕРЅ") {lat =  174.783; lon = -41.3;UTC =12;};
if (city == "Р’РµР»РёРєРёРµ Р›СѓРєРё") {lat =  56.34; lon = 30.54517;UTC =3;};
if (city == "Р’РµР»РёРєРёР№ РЈСЃС‚СЋРі") {lat = 60.7394; lon = 46.2056;UTC =3;};
if (city == "Р’РёР»СЊРЅСЋСЃ") {lat = 54.68916 ; lon = 25.2798;UTC =3;};
if (city == "Р’РёР»СЋР№СЃРє") {lat =  63,74; lon = 121,63; UTC = 9;};
if (city == "Р’РёРЅРЅРёС†Р°") {lat = 49.2328; lon = 28.4810;UTC =3;};
if (city == "Р’РёС‚РµР±СЃРє") {lat =  55.1904; lon = 30.2049;UTC =3;};
if (city == "Р’РѕР»РіРѕРґРѕРЅСЃРє") {lat =  59.2187; lon = 39.8886;UTC =3;};
if (city == "Р’РѕР»РѕРіРґР°") {lat =  59.2187; lon = 39.8886;UTC =3;};
if (city == "Р’РѕР»РѕС€РёРЅ") {lat = 48.6926 ; lon = 40.5129;UTC =3;};
if (city == "Р’РѕСЂРѕРЅРµР¶") {lat = 51.67204; lon = 39.1843;UTC =3;};
if (city == "Р’РѕСЂРєСѓС‚Р°") {lat = 67.49884 ; lon = 64.05253;UTC =3;};
if (city == "Р’РѕР»РіРѕРіСЂР°Рґ") {lat =  48.71939; lon = 44.50184;UTC =3;};
if (city == "Р’РѕР»РіРѕРґРѕРЅСЃРє") {lat =  47.5136; lon = 42.15139;UTC =3;};
if (city == "Р’СЂРѕС†Р»Р°РІ") {lat = 51.1; lon = 17.03;UTC = 2;};
if (city == "Р’Р»Р°РґРёРІРѕСЃС‚РѕРє") {lat =  43.10562; lon = 131.87353;UTC =10;};
if (city == "Р’Р»Р°РґРёРјРёСЂ") {lat = 56.1365; lon = 40.3966;UTC = 3;};
if (city == "Р’Р»Р°РґРёРєР°РІРєР°Р·") {lat = 43.0367; lon = 44.6678;UTC = 3;};
if (city == "Р’С‹С€РіРѕСЂРѕРґ") {lat = 50.5848; lon = 30.4898;UTC =3;};
if (city == "Р’СЏС‚РєР°") {lat = 58.4677; lon = 35.6686; UTC =6;};

if (city == "Р“Р°РІР°РЅР°") {lat = -82.35; lon = 23.167;UTC =-4;};
if (city == "Р“РґС‹РЅСЏ") {lat = 54,51; lon = 18,53;UTC = 2;};
if (city == "Р“РµРЅСѓСЏ") {lat = 44.4167; lon = 8.9500;UTC =2;};
if (city == "Р“РѕРјРµР»СЊ") {lat = 52.4054; lon = 30.7591;UTC =3;};
if (city == "Р“СЂРѕРґРЅРѕ") {lat = 53.6884; lon = 23.8258;UTC =3;};
if (city == "Р“СЂРѕР·РЅС‹Р№") {lat =43.3119; lon = 45.6890;UTC =3;};
if (city == "Р“РѕРЅРєРѕРЅРі") {lat = 114.167; lon = 22.3;UTC =8;};
if (city == "Р“РѕСЂРЅРѕ-РђР»С‚Р°Р№СЃРє") {lat = 51.9533; lon = 85.3325;UTC =6;};
if (city == "Р“Р°РІР°РЅР°") {lat = -82.35; lon = 23.167;UTC =-4;};
if (city == "Р“РµРЅСѓСЏ") {lat = 44.4167; lon = 8.9500;UTC =-4;};
if (city == "Р“РѕРјРµР»СЊ") {lat = 52.4054; lon = 30.7591;UTC =3;};
if (city == "Р“СЂРѕРґРЅРѕ") {lat = 53.6884; lon = 23.8258;UTC =3;};
if (city == "Р“СЂРѕР·РЅС‹Р№") {lat =43.3119; lon = 45.6890;UTC =-4;};
if (city == "Р“РѕРЅРєРѕРЅРі") {lat = 114.167; lon = 22.3;UTC =8;};

if (city == "Р”РµСЂР±РµРЅС‚") {lat = 42,06; lon = 48,28;UTC = 3;};
if (city == "Р”РёРєСЃРѕРЅ") {lat = 73,5; lon = 80,52;UTC = 7;};
if (city == "Р”РЅРµРїСЂРѕРїРµС‚СЂРѕРІСЃРє") {lat = 48.45 ; lon = 34.98333;UTC =3;};
if (city == "Р”РЅРµРїСЂРѕРґР·РµСЂР¶РёРЅСЃРє") {lat = 48.5113; lon = 34.6021;UTC =3;};
if (city == "Р”РѕРЅРµС†Рє") {lat =  48.023; lon = 37.80224 ;UTC =3;};
if (city == "Р”СѓР±Р»РёРЅ") {lat = -6.333; lon = 53.383;UTC =0;};
if (city == "Р”СѓР±РЅР°") {lat = 56.7333; lon = 37.1667 ;UTC =3;};
if (city == "Р”СѓС€Р°РЅР±Рµ") {lat = 38.53; lon = 68.779;UTC = 5;};


if (city == "Р•РІРїР°С‚РѕСЂРёСЏ") {lat = 45.2009; lon = 33.3665;UTC =3;};
if (city == "Р•Р№СЃРє") {lat = 46.6572; lon = 38.3328;UTC =4;};
if (city == "Р•РЅРёСЃРµР№СЃРє") {lat = 48,44; lon = 92,179;UTC = 7;};
if (city == "Р•РєР°С‚РµСЂРёРЅР±СѓСЂРі") {lat = 56.8575 ; lon = 60.6125;UTC =5;};
if (city == "Р•СЂРµРІР°РЅ") {lat =  40.18111; lon = 44.51361;UTC = 4;};

if (city == "Р–РµРЅРµРІР°") {lat = 46.1671; lon = 5.9997;UTC = 2;};
if (city == "Р–РёРіР°РЅСЃРє") {lat = 66.766; lon = 123.374;UTC = 9;};
if (city == "Р–РёС‚РѕРјРёСЂ") {lat = 50.2649; lon = 28.6767;UTC = 3;};
if (city == "Р–РµР»РµР·РЅРѕРіРѕСЂСЃРє") {lat = 52.3310; lon = 35.3711; UTC =8;};

if (city == "Р—Р°Р»СЊС†Р±СѓСЂРі") {lat = 47.8; lon = 13.04;UTC = 2;};
if (city == "Р—Р°РїРѕСЂРѕР¶СЊРµ") {lat = 47.822; lon = 35.19;UTC = 3;};
if (city == "Р—РµР»РµРЅРѕРіРѕСЂСЃРє") {lat =  60.1997; lon = 29.7018; UTC =7;};
if (city == "Р—Р°СЃР»Р°РІР»СЊ") {lat = 54.0114; lon = 27.2695;UTC = 3;};

if (city == "Р™РѕС€РєР°СЂ-РћР»Р°") {lat = 56.6369; lon = 47.8711; UTC =3;}; 

if (city == "РРµСЂСѓСЃР°Р»РёРј") {lat = 35.167; lon = 31.783;UTC =3;};
if (city == "РРІР°РЅРѕРІРѕ") {lat = 56.997; lon = 40.971;UTC =3;};
if (city == "РР¶РµРІСЃРє") {lat = 56.8498; lon = 53.2045;UTC =4;};
if (city == "РСЂРєСѓС‚СЃРє") {lat = 52.29778 ; lon = 104.29639 ;UTC =8;};

if (city == "РљР°Р»РёРЅРёРЅРіСЂР°Рґ") {lat = 54.7065; lon = 20.5110 ; UTC =2;};
if (city == "РљР°Р»СЊРєСѓС‚С‚Р°") {lat = 88.333; lon = 22.567;UTC =5.5;};
if (city == "РљР°Р»СѓРіР°") {lat = 54.5293 ; lon = 36.27542;UTC =3;};
if (city == "РљР°РјС‹С€РёРЅ") {lat =  50,09; lon = 45,416;UTC = 3;};
if (city == "РљР°СЂР°РєР°СЃ") {lat =  -66.917; lon = 10.5;UTC =-4.5;};
if (city == "РљР°С€РіР°СЂ") {lat =  39,47; lon = 75,98;UTC = 8;};
if (city == "РљР°Р·Р°РЅСЊ") {lat = 55.78874 ; lon = 49.12214;UTC =3;};
if (city == "РљР°СЃРїРёР№СЃРє") {lat = 42.8803; lon = 47.6383;UTC =3;};
if (city == "РљР°С€РёСЂР°") {lat = 54.7100; lon = 38.1600;UTC =3;};
if (city == "РљРІРµР±РµРє") {lat = 46.8000; lon = -71.2500;UTC =-5;};
if (city == "РљРµСЂС‡СЊ") {lat = 45.3607; lon = 36.4706;UTC =3;};
if (city == "РљРѕРїРµРЅРіР°РіРµРЅ") {lat = 12.667; lon = 55.633;UTC =2;};
if (city == "РљРѕРјРјСѓРЅР°СЂ") {lat = 59.6206 ; lon = 30.3900; UTC =3;};
if (city == "РљРѕРєС‚РµР±РµР»СЊ") {lat = 44.9615; lon = 35.2466; UTC =3;};
if (city == "РљРµРјРµСЂРѕРІРѕ") {lat = 55.3333; lon = 86.0833 ; UTC =7;};
if (city == "РљРѕРјСЃРѕРјРѕР»СЊСЃРє-РЅР°-РђРјСѓСЂРµ") {lat = 50.5670331; lon = 136.965894;UTC =10;};
if (city == "РљРѕС€РёС†Рµ") {lat =  48,71; lon = 21,25;UTC = 2;};
if (city == "РљСЂР°РєРѕРІ") {lat =  50,06; lon = 19,56;UTC = 2;};
if (city == "РљСЂР°СЃРЅРѕРіРѕСЂСЃРє") {lat = 55.8204; lon = 37.3302; UTC =3;};
if (city == "РљСЂР°СЃРЅРѕРґР°СЂ") {lat = 45.04484; lon = 38.97603;UTC =3;};
if (city == "РљСЂР°СЃРЅРѕСЏСЂСЃРє") {lat = 56.01839; lon = 92.86717;UTC =7;};
if (city == "РљСЂР°СЃРЅРѕСѓС„РёРјСЃРє") {lat = 56.7329; lon = 57.5876; UTC =5;};
if (city == "РљСЂРµРјРѕРЅР°") {lat = 45.1167; lon = 10.0333;UTC =2;};
if (city == "РљСЂРёРІРѕР№ Р РѕРі") {lat = 46.4286; lon = 34.2498;UTC =3;};
if (city == "РљСЂР°СЃРЅРѕР°СЂРјРµР№СЃРє") {lat = 48.2820; lon = 37.1758;UTC =3;};  
if (city == "РљР°РёСЂ") {lat = 31.25; lon = 30.05;UTC =2;};
if (city == "РљР»Р°Р№РїРµРґР°") {lat = 51,1; lon = 17,03;UTC = 3;};
if (city == "РљР»РµСЂРјРѕРЅ-Р¤РµСЂСЂР°РЅ") {lat = 45.7797; lon = 3.0863;UTC =2;};
if (city == "РљРёРµРІ") {lat = 50.45466; lon = 30.5238;UTC =3;};
if (city == "РљРёР·Р»СЏСЂ") {lat = 43.8471; lon = 46.71445;UTC =3;};
if (city == "РљРёСЂРѕРІ") {lat = 58.6100; lon = 49.4100;UTC =3;};
if (city == "РљРёС€РёРЅРµРІ") {lat =  47.00556; lon = 28.8575;UTC =3;};
if (city == "РљРёСЃР»РѕРІРѕРґСЃРє") {lat =  43.91333; lon = 42.72083;UTC =3;};
if (city == "РљРёРЅРіСЃС‚РѕРЅ") {lat = -76.783; lon = 17.933;UTC =-5;};
if (city == "РљРѕР·Р»РѕРІ") {lat = 49.9667; lon = 24.5333;UTC = 2;};
if (city == "РљСѓСЂРіР°РЅ") {lat = 55.4500; lon = 65.3333; UTC =5;};
if (city == "РљС‹Р·С‹Р»") {lat = 51.7000; lon = 94.45003;UTC = 7;};
if (city == "РљС‹Р·С‹Р»РѕСЂРґР°") {lat = 44.84; lon = 65.49;UTC = 6;};

if (city == "Р›РёРїРµС†Рє") {lat = 52.60311; lon = 39.57076;UTC =3;};
if (city == "Р›РѕРЅРґРѕРЅ") {lat = -0.1; lon = 51.517;UTC =0;};
if (city == "Р›РёСЃСЃР°Р±РѕРЅ") {lat = -9.15; lon = 38.700;UTC =1;};
if (city == "Р›СѓРіР°РЅСЃРє") {lat = 48.5670; lon = 39.3171;UTC =3;};
if (city == "Р›СѓС†Рє") {lat = 50.7593; lon = 25.3424;UTC =3;};
if (city == "Р›СЊРІРѕРІ") {lat = 49.83826; lon = 24.02324;UTC =3;};
if (city == "Р›СЋР±Р»РёРЅ") {lat = 51.25; lon = 22.56; UTC = 2;};

if (city == "РњР°РіРЅРёС‚РѕРіРѕСЂСЃРє") {lat = 53,41; lon = 59,04;UTC = 5;};
if (city == "РњР°РґСЂРёРґ") {lat = -3.683; lon = 40.400;UTC = 2;};
if (city == "РњР°СЂРё-РўСѓСЂРµРє") {lat = 56.789; lon = 49.62349;UTC = 3;};
if (city == "РњР°Р№РєРѕРї") {lat = 44.8802; lon = 40.2166;UTC = 3;};
if (city == "РњР°Р№РѕСЂРєР°") {lat = 51.238; lon = 83.51;UTC = 1;};
if (city == "РњР°РЅРёР»Р°") {lat = 120.983; lon = 14.583;UTC = 8;};
if (city == "РњР°СЂРёСѓРїРѕР»СЊ") {lat = 47.095; lon = 37.541;UTC =2;};
if (city == "РњР°СЂСЃРµР»СЊ") {lat = 43.2854; lon = 5.3761;UTC = 2;};
if (city == "РњР°РіР°РґР°РЅ") {lat =  59.5638 ; lon = 150.80347;UTC = 8;};
if (city == "РњР°С…Р°С‡РєР°Р»Р°") {lat =  42.97638 ; lon = 47.50236;UTC = 3;};
if (city == "РњРµРєРєР°") {lat = 39.817; lon = 21.433;UTC = 3;};
if (city == "РњРёРЅСЃРє") {lat = 53.9 ; lon = 27.56667;UTC = 3;};
if (city == "РњРёР»Р°РЅ") {lat = 45.4667; lon = 9.2000;UTC = 2;};
if (city == "РњРѕРЅСЂРµР°Р»СЊ") {lat = -73.583; lon = 45.5;UTC = -4;};
if (city == "РњРµС…РёРєРѕ") {lat = -99.2; lon = 19.4;UTC = -5;};
if (city == "РњРµР¶РґСѓСЂРµС‡РµРЅСЃРє") {lat = 53.6942; lon = 88.0603;UTC =7;};
if (city == "РњРёСЂРЅС‹Р№") {lat = 58.4933; lon = 47.6539;UTC =9;};
if (city == "РњРѕСЃРєРІР°") {lat = 37.833; lon = 55.75;UTC =3;};
if (city == "РњРѕРЅС‡РµРіРѕСЂСЃРє") {lat = 67.9397; lon = 32.8739;UTC =3;};
if (city == "РњСѓСЂРјР°РЅСЃРє") {lat = 68.9792; lon = 33.0925;UTC =3;};
if (city == "РњСѓСЂРѕРј") {lat = 55.5322; lon = 41.9703;UTC =3;};
if (city == "РњСЋРЅС…РµРЅ") {lat = 11.2; lon = 48.133;UTC =2;};

if (city == "РќР°РґС‹Рј") {lat = 65.5333; lon = 72.5167;UTC =5;};
if (city == "РќР°Р±РµСЂРµР¶РЅС‹Рµ Р§РµР»РЅС‹") {lat = 55.72545; lon = 52.41122 ;UTC =3;};
if (city == "РќР°С…РѕРґРєР°") {lat = 61.0745; lon = 24.5755;UTC =10;};
if (city == "РќР°РЅРєРёРЅ") {lat = 118.783; lon = 32.050;UTC =8;};
if (city == "РќР°СЂРІР°") {lat = 55.4011; lon = 93.6481 ;UTC =3;};
if (city == "РќР°Р»СЊС‡РёРє") {lat = 43.49806; lon = 43.61889;UTC =3;};
if (city == "РќРµР°РїРѕР»СЊ") {lat = 40.8333; lon = 14.2500;UTC =2;};
if (city == "РќРµРІРёРЅРЅРѕРјС‹СЃСЃРє") {lat = 44.6267; lon = 41.9453;UTC =3;};
if (city == "РќРѕРІРіРѕСЂРѕРґ") {lat = 42.6500 ; lon = 130.8031;UTC =3;};
if (city == "РќРѕРІРѕРїРѕР»РѕС†Рє") {lat = 55.5318; lon = 28.5987;UTC =3;};
if (city == "РќРѕРІРѕСЃРёР±РёСЂСЃРє") {lat =  55.0415; lon = 82.9346;UTC =7;};
if (city == "РќРѕРІРѕРєСѓР·РЅРµС†Рє") {lat = 53.7557; lon = 87.1099;UTC =7;};
if (city == "РќРµРІРёРЅРЅРѕРјС‹СЃСЃРє") {lat = 44.6267; lon = 41.9453;UTC =3;};
if (city == "РќРѕРІРіРѕСЂРѕРґ") {lat = 42.6500 ; lon = 130.8031;UTC =3;};
if (city == "РќРѕРІРѕСЂРѕСЃСЃРёР№СЃРє") {lat = 44.7244; lon = 37.7675;UTC =3;};
if (city == "РќРѕРІС‹Р№ РЈСЂРµРЅРіРѕР№") {lat = 66.0833; lon = 76.6333;UTC =5;};
if (city == "РќРёР¶РЅРёР№ РќРѕРІРіРѕСЂРѕРґ") {lat =  56.32867; lon = 44.00205 ;UTC =3;};
if (city == "РќРёР¶РЅРёР№ РўР°РіРёР»") {lat = 57.9194; lon = 59.9650;UTC =5;};
if (city == "РќРёР¶РЅРµРєР°РјСЃРє") {lat = 55.63657; lon = 51.82447 ;UTC =3;};
if (city == "РќРёРєРѕР»Р°РµРІ") {lat = 46.96591 ; lon = 31.9974;UTC =3;};
if (city == "РќРёРєРѕРїРѕР»СЊ") {lat = 47.5712; lon = 34.3964;UTC =3;};
if (city == "РќРѕСЂРёР»СЊСЃРє") {lat =  69.3535; lon = 88.2027;UTC =7;};
if (city == "РќСѓРєСѓСЃ") {lat =  42.45; lon = 59.61;UTC = 5;};
if (city == "РќСЊСЋ-Р™РѕСЂРє") {lat = -73.967; lon = 40.750;UTC =-4;};

if (city == "РћР±СѓС…РѕРІ") {lat = 48.7969; lon = 27.7646;UTC =3;};
if (city == "РћРґРµСЃСЃР°") {lat =  30.767; lon = 46.483;UTC =3;};
if (city == "РћР·РµСЂСЃРє") {lat = 54.1819; lon = 35.9261 ;UTC =5;};
if (city == "РћРјСЃРє") {lat =  54.99244; lon = 73.36859;UTC =6;};
if (city == "РћСЂС‘Р»") {lat =  52.96508; lon = 36.0785 ;UTC =3;};
if (city == "РћСЂСЃРє") {lat =  51.20487; lon = 58.5668;UTC = 5;};
if (city == "РћСЃР»Рѕ") {lat =  10.733; lon = 59.917;UTC =2;};
if (city == "РћС‚С‚Р°РІР°") {lat =  -75.667; lon = 45.317;UTC =-4;};
if (city == "РћСЂРµРЅР±СѓСЂРі") {lat =  51.7727; lon = 55.0988;UTC =5;};
if (city == "РћС…РѕС‚СЃРє") {lat = 59.36; lon = 143.21;UTC =10;};

if (city == "РџР°РЅР°РјР°") {lat =  -79.6; lon = 8.95;UTC =-5;};
if (city == "РџР°СЂРёР¶") {lat =  2.333; lon = 48.833;UTC =2;};
if (city == "РџР°Р»РµСЂРјРѕ") {lat = 38.1321; lon = 13.3356;UTC =2;};
if (city == "РџРµРєРёРЅ") {lat =  116.317; lon = 39.95;UTC =8;};
if (city == "РџРµС‚СЂРѕР·Р°РІРѕРґСЃРє") {lat = 61.78491; lon = 34.34691;UTC =3;};
if (city == "РџРµСЂРјСЊ") {lat =  58.01741; lon = 56.28552;UTC =5;};
if (city == "РџРµРЅР·Р°") {lat = 53.20066 ; lon = 45.00464;UTC =3;};
if (city == "РџРµСЂРµСЃР»Р°РІР»СЊ-Р—Р°Р»РµСЃСЃРєРёР№") {lat = 56.7328 ; lon = 38.9112;UTC =3;};
if (city == "РџРµС‚СЂРѕРїР°РІР»РѕРІСЃРє-РљР°РјС‡Р°С‚СЃРєРёР№") {lat = 53.04444 ; lon = 158.65076;UTC =12;};
if (city == "РџРµС‚СЂРѕРІСЃРє-Р—Р°Р±Р°Р№РєР°Р»СЊСЃРєРёР№") {lat = 51.2833; lon = 108.8333;UTC =9;};
if (city == "РџРёРѕРЅРµСЂСЃРєР°СЏ") {lat =  43.2167; lon = 131.9519;UTC =10;};
if (city == "РџРѕРґРѕР»") {lat = 49.6718; lon = 33.8883;UTC =3;};
if (city == "РџРѕР»РѕС†Рє") {lat = 55.4879; lon = 28.7856;UTC =3;};
if (city == "РџРѕР»С‚Р°РІР°") {lat = 49.5937; lon = 34.54;UTC =3;};
if (city == "РџРѕСЂС‚Сѓ") {lat = 41.1496; lon = -8.6110;UTC =1;};
if (city == "РџСЂР°РіР°") {lat =  14.417; lon = 50.083;UTC =2;};
if (city == "РџСЂРµС‚РѕСЂРёСЏ") {lat =  29.183; lon = -25.750;UTC =2;};
if (city == "РџСЃРєРѕРІ") {lat =  57.8136; lon = 28.3496;UTC =3;};
if (city == "РџСѓС€РєРёРЅ") {lat = 59.6873; lon = 30.3405;UTC =3;};
if (city == "РџСЏС‚РёРіРѕСЂСЃРє") {lat =  44.04861; lon = 43.05944;UTC =3;};

if (city == "Р РёРіР°") {lat =  56.946; lon = 24.10589;UTC =3;};
if (city == "Р РёРј") {lat =  12.233; lon = 41.8;UTC =1;};
if (city == "Р РёРѕ-РґРµ-Р–Р°РЅРµР№СЂРѕ") {lat =  -48.167; lon = -22.9;UTC =-3;};
if (city == "Р РѕРІРЅРѕ") {lat = 50.62 ; lon = 26.227; UTC =3;}
if (city == "Р РѕСЃС‚РѕРІ") {lat = 57.1914 ; lon = 39.4139; UTC =3;}
if (city == "Р РѕСЃС‚РѕРІ-РЅР°-Р”РѕРЅСѓ") {lat = 47.23135 ; lon = 39.72328;UTC =3;};
if (city == "Р СЏР·Р°РЅСЊ") {lat =  54.6269; lon = 39.6916;UTC =3;};

if (city == "РЎР°РЅРєС‚-РџРµС‚РµСЂР±СѓСЂРі") {lat = 59.89444; lon = 30.26417;UTC =3;};
if (city == "РЎР°Р№РіРѕРЅ") {lat =  106.7; lon = 10.817;UTC =7;};
if (city == "РЎР°Р»РµС…Р°СЂРґ") {lat = 66,53; lon = 66,60; UTC = 5;}
if (city == "РЎР°СЂР°РЅРїР°СѓР»СЊ") {lat = 64,26; lon = 60,9; UTC =5;}
if (city == "РЎР°СЂР°С‚РѕРІ") {lat =  51.54056; lon = 46.00861;UTC =3;};
if (city == "РЎР°РјР°СЂР°") {lat = 53.20006 ; lon = 50.15;UTC =3;};
if (city == "РЎР°СЏРЅСЃРє") {lat = 54.1088; lon = 102.1648;UTC =8;};
if (city == "РЎРІРµС‚Р»РѕРµ") {lat = 46.5422; lon = 138.3297;UTC =4;};
if (city == "РЎРµСѓР»") {lat =  126.95; lon = 37.533;UTC =9;};
if (city == "РЎРµСЂРїСѓС…РѕРІ") {lat =  54.9158; lon = 37.4111;UTC =3;};
if (city == "РЎРµРІР°СЃС‚РѕРїРѕР»СЊ") {lat =  44.58883; lon = 33.5224;UTC =3;};
if (city == "РЎРµРІРµСЂРѕРґРІРёРЅСЃРє") {lat = 64.5635; lon = 39.8302;UTC =3;};
if (city == "РЎРёРЅРіР°РїСѓСЂ") {lat = 103.85; lon = 1.267;UTC =8;};
if (city == "РЎРёРјС„РµСЂРѕРїРѕР»СЊ") {lat =  44.95719; lon = 34.11079;UTC =3;};
if (city == "РЎС‚РѕРєРіРѕР»СЊРј") {lat = 18.067; lon = 59.2; UTC =2;};
if (city == "РЎР»Р°РІСЏРЅСЃРє") {lat = 48.8414; lon = 37.5895;UTC =3;};
if (city == "РЎС‚РµСЂР»РёС‚Р°РјР°Рє") {lat = 53.62; lon = 55.95; UTC =3;}
if (city == "РЎРјРѕР»РµРЅСЃРє") {lat = 54.7818 ; lon = 32.0401;UTC =3;};
if (city == "РЎРЅРµР¶РЅРѕРіРѕСЂСЃРє (РњСѓСЂРј.РѕР±Р».)") {lat = 69.19; lon = 33,25; UTC =3;}
if (city == "РЎРёРґРЅРµР№") {lat = 151.167; lon = -33.917;UTC =10;};
if (city == "РЎРѕР»РёРєР°РјСЃРє") {lat = 59.6316; lon = 56.7685;UTC =5;};
if (city == "РЎРѕС‡Рё") {lat = 43.5992; lon = 39.7257;UTC =3;};
if (city == "РЎСЂРµРґРЅРµСѓСЂР°Р»СЊСЃРє") {lat = 56.9892; lon = 60.4666;UTC =5;};
if (city == "РЎС‚Р°РІСЂРѕРїРѕР»СЊ") {lat = 45.0428; lon = 41.9734 ;UTC =3;};
if (city == "РЎС‚РµСЂР»РёС‚Р°РјР°Рє") {lat = 53,62; lon = 55,95;UTC = 5;};
if (city == "РЎСѓРјС‹") {lat = 50,92; lon = 34,8; UTC =3;}
if (city == "РЎСѓСЂРіСѓС‚") {lat = 61.2500; lon = 73.4167; UTC =5;};
if (city == "РЎС‹РєС‚С‹РІРєР°СЂ") {lat = 61.67642; lon = 50.80994; UTC =3;};

if (city == "РўР°РіР°РЅСЂРѕРі") {lat = 47.2362; lon = 38.8969; UTC =3;};
if (city == "РўР°РјР±РѕРІ") {lat = 52.73169; lon = 41.44326; UTC =3;};
if (city == "РўР°Р»Р»РёРЅ") {lat =  59.43696; lon = 24.75353; UTC =3;};
if (city == "РўР°СЂС‚Сѓ") {lat =  58.38; lon = 26,72; UTC =3;};
if (city == "РўР±РёР»РёСЃРё") {lat = 41.69411; lon = 44.83368; UTC =4;};
if (city == "РўРёРєСЃРё") {lat = 71.6900200 ; lon = 128.8646700; UTC =9;};
if (city == "РўР°Р»РґС‹РєСѓСЂРіР°РЅ") {lat = 45.0156; lon = 78.3739;UTC =5;};
if (city == "РўР°С€РєРµРЅС‚") {lat = 41.26465; lon = 69.21627; UTC =5;};
if (city == "РўРІРµСЂСЊ") {lat = 56.86049 ;lat = 35.87603; UTC =3;};
if (city == "РўРµРїР»РѕРіРѕСЂСЃРє") {lat = 48.6031 ;lat = 38.5944; UTC =3;};
if (city == "РўРµРіРµСЂР°РЅ") {lat = 51.317; lon = 35.667; UTC = 1.5;};
if (city == "РўРѕРєРёРѕ") {lat =  139.75; lon = 35.667; UTC =6;};
if (city == "РўРѕСЂРѕРЅС‚Рѕ") {lat =  -79.367; lon = 43.65; UTC = -7;}; 
if (city == "РўРѕР»СЊСЏС‚С‚Рё") {lat =  53.5244; lon = 49.6038; UTC =4;};
if (city == "РўРѕРјСЃРє") {lat = 56.49771; lon = 84.97437; UTC =7;};
if (city == "РўСЂРёРїРѕР»Рё") {lat = 35.800; lon = 34.450; UTC =2;};
if (city == "РўСѓР»Р°") {lat =  54.20213 ; lon = 37.64429; UTC =3;};
if (city == "РўСѓСЂРёРЅ") {lat =  45.0500; lon = 7.6667; UTC =2;};
if (city == "РўСѓР»СѓР·Р°") {lat = 43.5995; lon = 1.4332; UTC =2;};
if (city == "РўСѓР°РїСЃРµ") {lat = 44.1847 ; lon = 39.2381; UTC =3;};
if (city == "РўСЋРјРµРЅСЊ") {lat = 57.15222 ; lon = 65.52722; UTC =5;};

if (city == "РЈР¶РіРѕСЂРѕРґ") {lat = 48.6167; lon = 22.3000; UTC =3;};
if (city == "РЈСЂР°Р»СЊСЃРє") {lat = 54.1208; lon = 59.1231; UTC =5;};
if (city == "РЈР»СЊСЏРЅРѕРІСЃРє") {lat = 54.3282 ; lon = 48.3866; UTC =4;};
if (city == "РЈР»Р°РЅ-Р‘Р°С‚РѕСЂ") {lat = 47.9; lon = 106.88; UTC = 8;}
if (city == "РЈР»Р°РЅ-РЈРґСЌ") {lat = 51.8272 ; lon = 107.6063; UTC =8;};
if (city == "РЈСЃС‚СЊ-РР»РёРјСЃРє") {lat = 58.0080 ; lon = 102.6693; UTC =8;};
if (city == "РЈС„Р°") {lat = 54.78517 ; lon = 56.04562; UTC =5;};
if (city == "РЈС…С‚Р°") {lat = 63.567; lon = 53.683; UTC = 3;};


if (city == "Р¤РµРѕРґРѕСЃРёСЏ") {lat = 45.0368; lon = 35.3779; UTC =3;};
if (city == "Р¤СЂР°РЅРєС„СѓСЂС‚") {lat = 50.1167; lon = 8.6833; UTC =1;};

if (city == "РҐР°РЅС‚С‹-РњР°РЅСЃРёР№СЃРє") {lat = 61.0042; lon = 69.0019; UTC =5;};
if (city == "РҐР°СЂСЊРєРѕРІ") {lat =  49.98081; lon = 36.25272; UTC =0;};
if (city == "РҐРµСЂСЃРѕРЅ") {lat = 46.6558; lon = 32.6178; UTC =3;};
if (city == "РҐРµР»СЊСЃРёРЅРєРё") {lat = 24.967; lon = 60.317; UTC =3;};
if (city == "РҐР°Р±Р°СЂРѕРІСЃРє") {lat = 48.48272; lon = 135.08379; UTC =10;};

if (city == "Р¦СЋСЂРёС…") {lat = 47.3667; lon = 8.5500; UTC =2;};

if (city == "Р§РµР±РѕРєСЃР°СЂС‹") {lat = 56.13222; lon = 47.25194; UTC =3;};
if (city == "Р§РµР»СЏР±РёРЅСЃРє") {lat = 55.8 ; lon = 61.23; UTC = 5;};
if (city == "Р§РµСЂРєРµСЃСЃРє") {lat = 44.2233 ; lon = 42.0578; UTC = 3;};
if (city == "Р§РµСЂРЅРёРіРѕРІ") {lat = 51.5; lon = 31.28; UTC =3;}
if (city == "Р§РµСЂРЅРѕРіРѕСЂСЃРє") {lat = 53.8236; lon = 91.2842; UTC =7;};
if (city == "Р§РµСЂРµРїРѕРІРµС†") {lat = 59.13333 ; lon = 37.9 ; UTC =3;};
if (city == "Р§РµСЂРЅРѕРІС†С‹") {lat = 48.2915; lon = 25.9403; UTC =3;};
if (city == "Р§РёС‚Р°") {lat = 52.0333; lon = 113.5500; UTC =9;};
if (city == "Р§СѓРјРёРєР°РЅ") {lat = 54.71; lon = 135.316; UTC =10;};

if (city == "Р­Р»РёСЃС‚Р°") {lat = 46.30778 ; lon = 44.25583; UTC =3;};
if (city == "Р­РЅРіРµР»СЊСЃ") {lat = 51.4839; lon = 46.1053; UTC =4;};

if (city == "Р®РіРѕСЂСЃРє") {lat = 61.31; lon = 53.683; UTC = 3;};
if (city == "Р®Р¶РЅРѕ-РЎР°С…Р°Р»РёРЅСЃРє") {lat = 46.9641127 ; lon = 142.73475559;UTC =3;};

if (city == "РЇР»С‚Р°") {lat = 44.5; lon = 34.16; UTC =3;}
if (city == "РЇРєСѓС‚СЃРє") {lat =  62.03389; lon = 129.73306;UTC =9;};
if (city == "РЇСЂРѕСЃР»Р°РІР»СЊ") {lat = 57.62987 ; lon = 39.87368;UTC =3;};

return{lon: lon,
       lat: lat,
	   UTC: UTC};
} 
