//РїРѕ РґР°С‚Рµ РѕРїСЂРµРґРµР»СЏРµС‚ РїСЂРµРґС‹РґСѓС‰РµРµ РЅРѕРІРѕР»СѓРЅРёРµ

function NewMoon(date,UTC)
{
//1901
/* year = date.getFullYear();
month = date.getMonth();
day = date.getDay();
hour = date.getHours();
min = date.getMinutes(); */
//Р±Р°Р·Р° РЅРѕРІРѕР»СѓРЅРёР№
var NM_date = [
	 new Date(1901, 0,   20,   14, 34),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
     new Date(1901, 1,   19,   2, 43),//С„РµРІСЂР°Р»СЊ
     new Date(1901, 2,   20,   12, 51),//РјР°СЂС‚
     new Date(1901, 3,   20,   21, 36),//Р°РїСЂРµР»СЊ
     new Date(1901, 4,   20,   5, 36),//РјР°Р№
     new Date(1901, 5,   20,   13, 31),//РёСЋРЅСЊ
     new Date(1901, 6,   20,   22, 09),//РёСЋР»СЊ
     new Date(1901, 7,   20,   08, 26),//Р°РІРіСѓСЃС‚
     new Date(1901, 8,   20,   21, 17),//СЃРµРЅС‚СЏР±СЂСЊ
     new Date(1901, 9,   20,   13, 10),//РѕРєС‚СЏР±СЂСЊ
     new Date(1901, 10,   20,   07, 33),//РЅРѕСЏР±СЂСЊ
     new Date(1901, 11,   20,   2, 52),//РґРµРєР°Р±СЂСЊ
//1902
	new Date(1902, 0,   9,   21, 13),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1902, 1,   8,   13, 20),//С„РµРІСЂР°Р»СЊ
	new Date(1902, 2,   10,   2, 48),//РјР°СЂС‚
	new Date(1902, 3,   8,   13, 48),//Р°РїСЂРµР»СЊ
	new Date(1902, 4,   7,   22, 44),//РјР°Р№
	new Date(1902, 5,   6,   6, 09),//РёСЋРЅСЊ
	new Date(1902, 6,   5,   12, 58),//РёСЋР»СЊ
	new Date(1902, 7,   3,   20, 16),//Р°РІРіСѓСЃС‚
	new Date(1902, 8,   2,   5, 18),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1902, 9,   1,   17, 07),//РѕРєС‚СЏР±СЂСЊ!!!!!
	new Date(1902, 9,   31,   8, 12),//РѕРєС‚СЏР±СЂСЊ!!!!!!!
	new Date(1902, 10,   30,  02, 03),//РЅРѕСЏР±СЂСЊ
	new Date(1902, 11,   29,  12, 23),//РґРµРєР°Р±СЂСЊ
//1903
	new Date(1903, 0,   28,   16, 37),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1903, 1,   27,   10, 18),//С„РµРІСЂР°Р»СЊ
	new Date(1903, 2,   29,   1, 24),//РјР°СЂС‚
	new Date(1903, 3,   27,   13, 30),//Р°РїСЂРµР»СЊ
	new Date(1903, 4,   26,   22, 48),//РјР°Р№
	new Date(1903, 5,   25,   6, 09),//РёСЋРЅСЊ
	new Date(1903, 6,   24,   12, 44),//РёСЋР»СЊ
	new Date(1903, 7,   22,   19, 49),//Р°РІРіСѓСЃС‚
	new Date(1903, 8,   21,   4, 29),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1903, 9,   20,   15, 29),//РѕРєС‚СЏР±СЂСЊ
	new Date(1903, 10,   19,   5, 08),//РЅРѕСЏР±СЂСЊ
	new Date(1903, 11,   18,  21, 24),//РґРµРєР°Р±СЂСЊ
//1904
	new Date(1904, 0,   17,   15, 45),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1904, 1,   16,   11, 03),//С„РµРІСЂР°Р»СЊ
	new Date(1904, 2,   17,   5, 37),//РјР°СЂС‚
	new Date(1904, 3,   15,   21, 51),//Р°РїСЂРµР»СЊ
	new Date(1904, 4,   15,   10, 56),//РјР°Р№
	new Date(1904, 5,   13,   21, 09),//РёСЋРЅСЊ
	new Date(1904, 6,   13,   5, 26),//РёСЋР»СЊ
	new Date(1904, 7,   11,   12, 57),//Р°РІРіСѓСЃС‚
	new Date(1904, 8,   09,   20, 41),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1904, 9,   09,   5, 23),//РѕРєС‚СЏР±СЂСЊ
	new Date(1904, 10,   07,   15, 35),//РЅРѕСЏР±СЂСЊ
	new Date(1904, 11,   07,  3, 45),//РґРµРєР°Р±СЂСЊ
//1905
	new Date(1905, 0,   5,   18, 16),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1905, 1,  4,   11, 04),//С„РµРІСЂР°Р»СЊ
	new Date(1905, 2,   6,   5, 18),//РјР°СЂС‚
	new Date(1905, 3,   4,   23, 22),//Р°РїСЂРµР»СЊ
	new Date(1905, 4,   4,   15, 49),//РјР°Р№
	new Date(1905, 5,   3,   5, 55),//РёСЋРЅСЊ
	new Date(1905, 6,   2,   17, 58),//РёСЋР»СЊ
	new Date(1905, 7,   1,   4, 01),//Р°РІРіСѓСЃС‚
	new Date(1905, 7,   30,   13, 12),//Р°РІРіСѓСЃС‚
	new Date(1905, 8,   28,   21, 58),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1905, 9,   28,   6, 56),//РѕРєС‚СЏР±СЂСЊ
	new Date(1905, 9,   26,   16, 46),//РЅРѕСЏР±СЂСЊ
	new Date(1905, 10,   26,  4, 02),//РґРµРєР°Р±СЂСЊ
//1906
	new Date(1906, 0,   24,   17, 08),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1906, 1,   23,   07, 56),//С„РµРІСЂР°Р»СЊ
	new Date(1906, 2,   24,   23, 50),//РјР°СЂС‚
	new Date(1906, 3,   23,   16, 05),//Р°РїСЂРµР»СЊ
	new Date(1906, 4,   23,   07, 59),//РјР°Р№
	new Date(1906, 5,   21,   23, 04),//РёСЋРЅСЊ
	new Date(1906, 6,   21,   12, 58),//РёСЋР»СЊ
	new Date(1906, 7,   20,   1, 26),//Р°РІРіСѓСЃС‚
	new Date(1906, 8,   18,   12, 32),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1906, 9,   17,   22, 41),//РѕРєС‚СЏР±СЂСЊ
	new Date(1906, 10,   16,   8, 35),//РЅРѕСЏР±СЂСЊ
	new Date(1906, 11,   15,  18, 53),//РґРµРєР°Р±СЂСЊ
//1907
	new Date(1907, 0,   14,   05, 55),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1907, 1,   12,   17, 41),//С„РµРІСЂР°Р»СЊ
	new Date(1907, 2,   14,   06, 03),//РјР°СЂС‚
	new Date(1907, 3,   12,   19, 04),//Р°РїСЂРµР»СЊ
	new Date(1907, 4,   12,   08, 57),//РјР°Р№
	new Date(1907, 5,   10,   23, 48),//РёСЋРЅСЊ
	new Date(1907, 6,   10,   15, 15),//РёСЋР»СЊ
	new Date(1907, 7,   09,   06, 35),//Р°РІРіСѓСЃС‚
	new Date(1907, 8,   07,   21, 02),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1907, 9,   07,   10, 19),//РѕРєС‚СЏР±СЂСЊ
	new Date(1907, 10,   05,   22, 37),//РЅРѕСЏР±СЂСЊ
	new Date(1907, 11,   05,  10, 21),//РґРµРєР°Р±СЂСЊ

//1908
	new Date(1908, 0,   3,   21, 42),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1908, 1,   2,   08, 35),//С„РµРІСЂР°Р»СЊ
	new Date(1908, 2,   2,   18, 55),//РјР°СЂС‚
	new Date(1908, 3,   1,   05, 00),//Р°РїСЂРµР»СЊ
	new Date(1908, 3,   30,   15, 31),//Р°РїСЂРµР»СЊ!!!
	new Date(1908, 4,   30,   03, 13),//РјР°Р№
	new Date(1908, 5,   28,   16, 30),//РёСЋРЅСЊ
	new Date(1908, 6,   28,   7, 15),//РёСЋР»СЊ
	new Date(1908, 7,   26,   22, 57),//Р°РІРіСѓСЃС‚
	new Date(1908, 8,   25,   14, 58),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1908, 9,   25,   06, 45),//РѕРєС‚СЏР±СЂСЊ
	new Date(1908, 10,   23,   21, 52),//РЅРѕСЏР±СЂСЊ
	new Date(1908, 11,   23,  11, 48),//РґРµРєР°Р±СЂСЊ
//1909
	new Date(1909, 0,   22,   00, 10),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1909, 1,   20,   10, 50),//С„РµРІСЂР°Р»СЊ
	new Date(1909, 2,   21,   20, 10),//РјР°СЂС‚
	new Date(1909, 3,   20,   04, 50),//Р°РїСЂРµР»СЊ
	new Date(1909, 4,   19,   13, 40),//РјР°Р№
	new Date(1909, 5,   17,   23, 26),//РёСЋРЅСЊ
	new Date(1909, 6,   17,   10, 43),//РёСЋР»СЊ
	new Date(1909, 7,   15,   23, 53),//Р°РІРіСѓСЃС‚
	new Date(1909, 8,   14,   15, 07),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1909, 9,   14,   08, 12),//РѕРєС‚СЏР±СЂСЊ
	new Date(1909, 10,   13,   02, 17),//РЅРѕСЏР±СЂСЊ
	new Date(1909, 11,   12,  19, 57),//РґРµРєР°Р±СЂСЊ

//1910
	new Date(1910, 0,   11,   11, 50),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1910, 1,   10,   01, 11),//С„РµРІСЂР°Р»СЊ
	new Date(1910, 2,   11,   12, 11),//РјР°СЂС‚
	new Date(1910, 3,   19,   21, 23),//Р°РїСЂРµР»СЊ
	new Date(1910, 4,   09,   05, 31),//РјР°Р№
	new Date(1910, 5,   07,   13, 14),//РёСЋРЅСЊ
	new Date(1910, 6,   06,   21, 18),//РёСЋР»СЊ
	new Date(1910, 7,   05,   06, 35),//Р°РІРіСѓСЃС‚
	new Date(1910, 8,   03,   18, 04),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1910,  9,   03,   08, 30),//РѕРєС‚СЏР±СЂСЊ
	new Date(1910, 10,   02,   01, 54),//РЅРѕСЏР±СЂСЊ
	new Date(1910, 11,   01,  21, 09),//РґРµРєР°Р±СЂСЊ
	new Date(1910, 11,   31,  16, 19),//РґРµРєР°Р±СЂСЊ

//1911
	new Date(1911, 0,   30,   09, 43),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1911, 2,   01,   00, 29),//РјР°СЂС‚
	new Date(1911, 2,   30,   12, 36),//РјР°СЂС‚
	new Date(1911, 3,   28,   22, 23),//Р°РїСЂРµР»СЊ
	new Date(1911, 4,   28,   06, 22),//РјР°Р№
	new Date(1911, 5,   26,   13, 18),//РёСЋРЅСЊ
	new Date(1911, 6,   25,   20, 10),//РёСЋР»СЊ
	new Date(1911, 7,   24,   04, 12),//Р°РІРіСѓСЃС‚
	new Date(1911, 8,   22,   14, 35),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1911, 9,   22,   04, 07),//РѕРєС‚СЏР±СЂСЊ
	new Date(1911, 10,   20,   20, 48),//РЅРѕСЏР±СЂСЊ
	new Date(1911, 11,   20,  15, 38),//РґРµРєР°Р±СЂСЊ
	
//1912
	new Date(1912, 0,   19,   11, 08),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1912, 1,   18,   05, 42),//С„РµРІСЂР°Р»СЊ
	new Date(1912, 2,   18,   22, 07),//РјР°СЂС‚
	new Date(1912, 3,   17,   11, 38),//Р°РїСЂРµР»СЊ
	new Date(1912, 4,   16,   22, 12),//РјР°Р№
	new Date(1912, 5,   15,   06, 22),//РёСЋРЅСЊ
	new Date(1912, 6,   14,   13, 11),//РёСЋР»СЊ
	new Date(1912, 7,   12,   19, 56),//Р°РІРіСѓСЃС‚
	new Date(1912, 8,   11,   03, 46),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1912, 9,   10,   13, 39),//РѕРєС‚СЏР±СЂСЊ
	new Date(1912, 10,   09,   02, 03),//РЅРѕСЏР±СЂСЊ
	new Date(1912, 11,   08,  17, 05),//РґРµРєР°Р±СЂСЊ
	
//1913
	new Date(1913, 0,   07,   10, 27),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1913, 1,   06,   05, 20),//С„РµРІСЂР°Р»СЊ
	new Date(1913, 2,   08,   00, 20),//РјР°СЂС‚
	new Date(1913, 3,   06,   17, 46),//Р°РїСЂРµР»СЊ  
	new Date(1913, 4,   06,   08, 23),//РјР°Р№
	new Date(1913, 5,   04,   19, 55),//РёСЋРЅСЊ
	new Date(1913, 6,   04,   05, 04),//РёСЋР»СЊ
	new Date(1913, 7,   02,   12, 56),//Р°РІРіСѓСЃС‚
	new Date(1913, 7,   31,   20, 36),//Р°РІРіСѓСЃС‚
	new Date(1913, 8,   30,   04, 55),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1913, 9,   29,   14, 27),//РѕРєС‚СЏР±СЂСЊ
	new Date(1913, 10,   28,   01, 40),//РЅРѕСЏР±СЂСЊ
	new Date(1913, 11,   27,  14, 57),//РґРµРєР°Р±СЂСЊ	

//1914
	new Date(1914, 0,   26,   06, 32),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1914, 1,   25,   00, 00),//С„РµРІСЂР°Р»СЊ
	new Date(1914, 2,   26,   18, 07),//РјР°СЂС‚
	new Date(1914, 3,   25,   11, 20),//Р°РїСЂРµР»СЊ  
	new Date(1914, 4,   25,   02, 33),//РјР°Р№
	new Date(1914, 5,   23,   15, 31),//РёСЋРЅСЊ
	new Date(1914, 6,   23,   02, 37),//РёСЋР»СЊ
	new Date(1914, 7,   21,   12, 25),//Р°РІРіСѓСЃС‚
	new Date(1914, 8,   19,   21, 31),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1914, 9,   19,   06, 32),//РѕРєС‚СЏР±СЂСЊ
	new Date(1914, 10,   17,   16, 00),//РЅРѕСЏР±СЂСЊ
	new Date(1914, 11,   17,  02, 33),//РґРµРєР°Р±СЂСЊ	
//1915
	new Date(1915, 0,   15,   14, 40),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1915, 1,   14,   04, 29),//С„РµРІСЂР°Р»СЊ
	new Date(1915, 2,   15,   19, 40),//РјР°СЂС‚
	new Date(1915, 3,   14,   11, 34),//Р°РїСЂРµР»СЊ  
	new Date(1915, 4,   14,   03, 29),//РјР°Р№
	new Date(1915, 5,   12,   18, 55),//РёСЋРЅСЊ
	new Date(1915, 6,   12,   09, 29),//РёСЋР»СЊ
	new Date(1915, 7,   10,   22, 50),//Р°РІРіСѓСЃС‚
	new Date(1915, 8,   09,   10, 50),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1915, 9,   08,   21, 40),//РѕРєС‚СЏР±СЂСЊ
	new Date(1915, 10,   07,   07, 50),//РЅРѕСЏР±СЂСЊ
	new Date(1915, 11,   06,  18, 02),//РґРµРєР°Р±СЂСЊ	
//1916
	new Date(1916, 0,   05,   04, 44),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1916, 1,   03,   16, 04),//С„РµРІСЂР°Р»СЊ
	new Date(1916, 2,   04,   03, 56),//РјР°СЂС‚
	new Date(1916, 3,   02,   16, 19),//Р°РїСЂРµР»СЊ  
	new Date(1916, 4,   02,   05, 27),//РјР°Р№
	new Date(1916, 4,   31,   19, 35),//РјР°Р№!!!!!
	new Date(1916, 5,   30,   10, 42),//РёСЋРЅСЊ
	new Date(1916, 6,   30,   02, 13),//РёСЋР»СЊ
	new Date(1916, 7,   28,   17, 23),//Р°РІРіСѓСЃС‚
	new Date(1916, 8,   27,   07, 32),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1916, 9,   26,   20, 35),//РѕРєС‚СЏР±СЂСЊ
	new Date(1916, 10,   25,   08, 49),//РЅРѕСЏР±СЂСЊ
	new Date(1916, 11,   24,  20, 29),//РґРµРєР°Р±СЂСЊ
//1917
	new Date(1917, 0,   23,   07, 38),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1917, 1,   21,   18, 07),//С„РµРІСЂР°Р»СЊ
	new Date(1917, 2,   23,   04, 03),//РјР°СЂС‚
	new Date(1917, 3,   21,   14, 00),//Р°РїСЂРµР»СЊ  
	new Date(1917, 4,   21,   00, 45),//РјР°Р№
	new Date(1917, 5,   19,   13, 01),//РёСЋРЅСЊ
	new Date(1917, 6,   19,   02, 58),//РёСЋР»СЊ
	new Date(1917, 7,   17,   18, 19),//Р°РІРіСѓСЃС‚
	new Date(1917, 8,   16,   10, 26),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1917, 9,   16,   02, 39),//РѕРєС‚СЏР±СЂСЊ
	new Date(1917, 10,   14,   18, 27),//РЅРѕСЏР±СЂСЊ
	new Date(1917, 11,   14,  09, 16),//РґРµРєР°Р±СЂСЊ	

//1918
	new Date(1918, 0,   12,   22, 34),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1918, 1,   11,   10, 03),//С„РµРІСЂР°Р»СЊ
	new Date(1918, 2,   12,   19, 51),//РјР°СЂС‚
	new Date(1918, 3,   11,   04, 33),//Р°РїСЂРµР»СЊ  
	new Date(1918, 4,   10,   12, 59),//РјР°Р№
	new Date(1918, 5,   08,   22, 01),//РёСЋРЅСЊ
	new Date(1918, 6,   08,   08, 20),//РёСЋР»СЊ
	new Date(1918, 7,   06,   20, 28),//Р°РІРіСѓСЃС‚
	new Date(1918, 8,   05,   10, 42),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1918, 9,   05,   03, 03),//РѕРєС‚СЏР±СЂСЊ
	new Date(1918, 10,   03,   21, 00),//РЅРѕСЏР±СЂСЊ
	new Date(1918, 11,   03,  15, 17),//РґРµРєР°Р±СЂСЊ	

//1919
	new Date(1919, 0,   02,   08, 22),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1919, 0,   31,   23, 05),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ!!!
	new Date(1919, 2,   02,   11, 09),//РјР°СЂС‚!!!
	new Date(1919, 2,   31,   21, 03),//РјР°СЂС‚
	new Date(1919, 3,   30,   05, 29),//Р°РїСЂРµР»СЊ  
	new Date(1919, 4,   29,   13, 10),//РјР°Р№
	new Date(1919, 5,   27,   20, 51),//РёСЋРЅСЊ
	new Date(1919, 6,   27,   05, 20),//РёСЋР»СЊ
	new Date(1919, 7,   25,   15, 35),//Р°РІРіСѓСЃС‚
	new Date(1919, 8,   24,   04, 32),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1919, 9,   23,   20, 37),//РѕРєС‚СЏР±СЂСЊ
	new Date(1919, 10,   22,   15, 18),//РЅРѕСЏР±СЂСЊ
	new Date(1919, 11,   22,  10, 53),//РґРµРєР°Р±СЂСЊ	

//1920
	new Date(1920, 0,   21,   05, 25),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1920, 1,   19,   21, 33),//С„РµРІСЂР°Р»СЊ
	new Date(1920, 2,   20,   10, 54),//РјР°СЂС‚
	new Date(1920, 3,   18,   21, 41),//Р°РїСЂРµР»СЊ  
	new Date(1920, 4,   18,   06, 23),//РјР°Р№
	new Date(1920, 5,   16,   13, 39),//РёСЋРЅСЊ
	new Date(1920, 6,   15,   20, 23),//РёСЋР»СЊ
	new Date(1920, 7,   14,   03, 42),//Р°РІРіСѓСЃС‚
	new Date(1920, 8,   12,   12, 50),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1920, 9,   12,   00, 49),//РѕРєС‚СЏР±СЂСЊ
	new Date(1920, 10,   10,   16, 03),//РЅРѕСЏР±СЂСЊ
	new Date(1920, 11,   10,  10, 02),//РґРµРєР°Р±СЂСЊ	
//1921
	new Date(1921, 0,   09,   05, 25),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1921, 1,   08,   00, 35),//С„РµРІСЂР°Р»СЊ
	new Date(1921, 2,   09,   18, 07),//РјР°СЂС‚
	new Date(1921, 3,   08,   09, 03),//Р°РїСЂРµР»СЊ  
	new Date(1921, 4,   07,   21, 00),//РјР°Р№
	new Date(1921, 5,   06,   06, 13),//РёСЋРЅСЊ
	new Date(1921, 6,   05,   13, 34),//РёСЋР»СЊ
	new Date(1921, 7,   03,   20, 16),//Р°РІРіСѓСЃС‚
	new Date(1921, 8,   02,   03, 31),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1921, 9,   01,   12, 25),//РѕРєС‚СЏР±СЂСЊ
	new Date(1921, 9,   30,   23, 37),//РѕРєС‚СЏР±СЂСЊ!!!
	new Date(1921, 10,   29,   13, 24),//РЅРѕСЏР±СЂСЊ
	new Date(1921, 11,   29,  05, 37),//РґРµРєР°Р±СЂСЊ	

//1922
	new Date(1922, 0,   27,   23, 46),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1922, 1,   26,   18, 46),//С„РµРІСЂР°Р»СЊ
	new Date(1922, 2,   28,   13, 02),//РјР°СЂС‚
	new Date(1922, 3,   27,   05, 02),//Р°РїСЂРµР»СЊ  
	new Date(1922, 4,   26,   18, 02),//РјР°Р№
	new Date(1922, 5,   25,   04, 18),//РёСЋРЅСЊ
	new Date(1922, 6,   24,   12, 45),//РёСЋР»СЊ
	new Date(1922, 7,   22,   20, 32),//Р°РІРіСѓСЃС‚
	new Date(1922, 8,   21,   04, 36),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1922, 9,   20,   13, 38),//РѕРєС‚СЏР±СЂСЊ
	new Date(1922, 10,   19,   00, 05),//РЅРѕСЏР±СЂСЊ
	new Date(1922, 11,   18,  12, 18),//РґРµРєР°Р±СЂСЊ	
//1923
	new Date(1923, 0,   17,   02, 39),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1923, 1,   15,   19, 05),//С„РµРІСЂР°Р»СЊ
	new Date(1923, 2,   17,   12, 49),//РјР°СЂС‚
	new Date(1923, 3,   16,   06, 27),//Р°РїСЂРµР»СЊ  
	new Date(1923, 4,   15,   22, 37),//РјР°Р№
	new Date(1923, 5,   14,   12, 40),//РёСЋРЅСЊ
	new Date(1923, 6,   14,   00, 43),//РёСЋР»СЊ
	new Date(1923, 7,   12,   11, 15),//Р°РІРіСѓСЃС‚
	new Date(1923, 8,   10,   20, 51),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1923, 9,   10,   06, 04),//РѕРєС‚СЏР±СЂСЊ
	new Date(1923, 10,   08,   15, 25),//РЅРѕСЏР±СЂСЊ
	new Date(1923, 11,   08,  01, 29),//РґРµРєР°Р±СЂСЊ	
//1924
	new Date(1924, 0,   06,   12, 46),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1924, 1,   05,   01, 37),//С„РµРІСЂР°Р»СЊ
	new Date(1924, 2,   05,   15, 56),//РјР°СЂС‚
	new Date(1924, 3,   04,   07, 15),//Р°РїСЂРµР»СЊ  
	new Date(1924, 4,   03,   22, 58),//РјР°Р№
	new Date(1924, 5,   02,   14, 32),//РёСЋРЅСЊ
	new Date(1924, 6,   02,   05, 33),//РёСЋР»СЊ
	new Date(1924, 6,   31,   19, 40),//РёСЋР»СЊ!!!!!!!!!
	new Date(1924, 7,   30,   08, 35),//Р°РІРіСѓСЃС‚
	new Date(1924, 8,   28,   20, 14),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1924, 9,   28,   06, 55),//РѕРєС‚СЏР±СЂСЊ
	new Date(1924, 10,   26,   17, 14),//РЅРѕСЏР±СЂСЊ
	new Date(1924, 11,   26,  03, 44),//РґРµРєР°Р±СЂСЊ	
//1925
	new Date(1925, 0,   24,   14, 43),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1925, 1,   23,   02, 10),//С„РµРІСЂР°Р»СЊ
	new Date(1925, 2,   24,   14, 01),//РјР°СЂС‚
	new Date(1925, 3,   23,   02, 26),//Р°РїСЂРµР»СЊ  
	new Date(1925, 4,   22,   15, 46),//РјР°Р№
	new Date(1925, 5,   21,   06, 15),//РёСЋРЅСЊ
	new Date(1925, 6,   20,   21, 38),//РёСЋР»СЊ
	new Date(1925, 7,   19,   13, 13),//Р°РІРіСѓСЃС‚
	new Date(1925, 8,   18,   04, 11),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1925, 9,   17,   18, 04),//РѕРєС‚СЏР±СЂСЊ
	new Date(1925, 10,   16,   06, 56),//РЅРѕСЏР±СЂСЊ
	new Date(1925, 11,   15,  19, 04),//РґРµРєР°Р±СЂСЊ	

//1926
	new Date(1926, 0,   14,   06, 33),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1926, 1,   12,   17, 19),//С„РµРІСЂР°Р»СЊ
	new Date(1926, 2,   14,   03, 18),//РјР°СЂС‚
	new Date(1926, 3,   12,   12, 55),//Р°РїСЂРµР»СЊ  
	new Date(1926, 4,   11,   22, 54),//РјР°Р№
	new Date(1926, 5,   10,   10, 06),//РёСЋРЅСЊ
	new Date(1926, 6,   09,   23, 05),//РёСЋР»СЊ
	new Date(1926, 7,   08,   13, 47),//Р°РІРіСѓСЃС‚
	new Date(1926, 8,   07,   05, 43),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1926, 9,   06,   22, 11),//РѕРєС‚СЏР±СЂСЊ
	new Date(1926, 10,   05,   14, 33),//РЅРѕСЏР±СЂСЊ
	new Date(1926, 11,   05,  06, 10),//РґРµРєР°Р±СЂСЊ	

//1927
	new Date(1927, 0,   03,   20, 26),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1927, 1,   02,   08, 53),//С„РµРІСЂР°Р»СЊ
	new Date(1927, 2,   03,   19, 23),//РјР°СЂС‚
	new Date(1927, 3,   02,   04, 22),//Р°РїСЂРµР»СЊ  
	new Date(1927, 4,   01,   12, 38),//РјР°Р№
	new Date(1927, 4,   30,   21, 04),//РјР°Р№
	new Date(1927, 5,   29,   06, 30),//РёСЋРЅСЊ
	new Date(1927, 6,   28,   17, 34),//РёСЋР»СЊ
	new Date(1927, 7,   27,   06, 43),//Р°РІРіСѓСЃС‚
	new Date(1927, 8,   25,   22, 09),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1927, 9,   25,   15, 36),//РѕРєС‚СЏР±СЂСЊ
	new Date(1927, 10,   24,   10, 08),//РЅРѕСЏР±СЂСЊ
	new Date(1927, 11,   24,  04, 12),//РґРµРєР°Р±СЂСЊ	
//1928
	new Date(1928, 0,   22,   20, 17),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1928, 1,   21,   09, 39),//С„РµРІСЂР°Р»СЊ
	new Date(1928, 2,   21,   20, 27),//РјР°СЂС‚
	new Date(1928, 3,   20,   05, 23),//Р°РїСЂРµР»СЊ  
	new Date(1928, 4,   19,   13, 12),//РјР°Р№
	new Date(1928, 5,   17,   20, 40),//РёСЋРЅСЊ
	new Date(1928, 6,   17,   04, 34),//РёСЋР»СЊ
	new Date(1928, 7,   15,   13, 47),//Р°РІРіСѓСЃС‚
	new Date(1928, 8,   14,   01, 18),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1928, 9,   13,   15, 54),//РѕРєС‚СЏР±СЂСЊ
	new Date(1928, 10,   12,   09, 34),//РЅРѕСЏР±СЂСЊ
	new Date(1928, 11,   12,  05, 04),//РґРµРєР°Р±СЂСЊ	
//1929
	new Date(1929, 0,   11,   00, 27),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1929, 1,   09,   17, 54),//С„РµРІСЂР°Р»СЊ
	new Date(1929, 2,   11,   08, 35),//РјР°СЂС‚
	new Date(1929, 3,   09,   20, 31),//Р°РїСЂРµР»СЊ  
	new Date(1929, 4,   09,   06, 06),//РјР°Р№
	new Date(1929, 5,   07,   13, 55),//РёСЋРЅСЊ
	new Date(1929, 6,   06,   20, 45),//РёСЋР»СЊ
	new Date(1929, 7,   05,   03, 38),//Р°РІРіСѓСЃС‚
	new Date(1929, 8,   03,   11, 46),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1929, 9,   02,   22, 17),//РѕРєС‚СЏР±СЂСЊ
	new Date(1929, 10,   01,   11, 59),//РЅРѕСЏР±СЂСЊ
	new Date(1929, 11,   01,  04, 47),//РґРµРєР°Р±СЂСЊ	
	new Date(1929, 11,   30,  23, 40),//РґРµРєР°Р±СЂСЊ
//1930
	new Date(1930, 0,   29,   19, 06),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1930, 1,   28,   13, 31),//С„РµРІСЂР°Р»СЊ
	new Date(1930, 2,   30,   05, 45),//РјР°СЂС‚
	new Date(1930, 3,   28,   19, 07),//Р°РїСЂРµР»СЊ  
	new Date(1930, 4,   28,   05, 35),//РјР°Р№
	new Date(1930, 5,   26,   13, 45),//РёСЋРЅСЊ
	new Date(1930, 6,   25,   20, 40),//РёСЋР»СЊ
	new Date(1930, 7,   24,   03, 35),//Р°РІРіСѓСЃС‚
	new Date(1930, 8,   22,   11, 40),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1930, 9,   21,   21, 46),//РѕРєС‚СЏР±СЂСЊ
	new Date(1930, 10,   20,   10, 20),//РЅРѕСЏР±СЂСЊ
	new Date(1930, 11,   20,  01, 22),//РґРµРєР°Р±СЂСЊ	
//1931
	new Date(1931, 0,   18,   18, 34),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1931, 1,   17,   13, 09),//С„РµРІСЂР°Р»СЊ
	new Date(1931, 2,   19,   07, 49),//РјР°СЂС‚
	new Date(1931, 3,   18,   00, 58),//Р°РїСЂРµР»СЊ  
	new Date(1931, 4,   17,   15, 26),//РјР°Р№
	new Date(1931, 5,   16,   03, 00),//РёСЋРЅСЊ
	new Date(1931, 6,   15,   12, 18),//РёСЋР»СЊ
	new Date(1931, 7,   13,   20, 25),//Р°РІРіСѓСЃС‚
	new Date(1931, 8,   12,   04, 25),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1931, 9,   11,   13, 04),//РѕРєС‚СЏР±СЂСЊ
	new Date(1931, 10,   09,   22, 54),//РЅРѕСЏР±СЂСЊ
	new Date(1931, 11,   09,  10, 15),//РґРµРєР°Р±СЂСЊ	
//1932
	new Date(1932, 0,   07,   23, 27),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1932, 1,   06,   14, 44),//С„РµРІСЂР°Р»СЊ
	new Date(1932, 2,   07,   07, 43),//РјР°СЂС‚
	new Date(1932, 3,   06,   01, 19),//Р°РїСЂРµР»СЊ  
	new Date(1932, 4,   05,   18, 10),//РјР°Р№
	new Date(1932, 5,   04,   09, 14),//РёСЋРЅСЊ
	new Date(1932, 6,   03,   22, 18),//РёСЋР»СЊ
	new Date(1932, 7,   02,   09, 40),//Р°РІРіСѓСЃС‚
	new Date(1932, 7,   31,   19, 53),//Р°РІРіСѓСЃС‚!!!!!!!!!
	new Date(1932, 8,   30,   05, 28),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1932, 9,   29,   14, 55),//РѕРєС‚СЏР±СЂСЊ
	new Date(1932, 10,   28,   00, 42),//РЅРѕСЏР±СЂСЊ
	new Date(1932, 11,   27,  11, 21),//РґРµРєР°Р±СЂСЊ	
//1933
	new Date(1933, 0,   25,   23, 18),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1933, 1,   24,   12, 42),//С„РµРІСЂР°Р»СЊ
	new Date(1933, 2,   26,   03, 19),//РјР°СЂС‚
	new Date(1933, 3,   24,   18, 37),//Р°РїСЂРµР»СЊ  
	new Date(1933, 4,   24,   10, 05),//РјР°Р№
	new Date(1933, 5,   23,   01, 21),//РёСЋРЅСЊ
	new Date(1933, 6,   22,   16, 02),//РёСЋР»СЊ
	new Date(1933, 7,   21,   05, 46),//Р°РІРіСѓСЃС‚
	new Date(1933, 8,   19,   18, 19),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1933, 9,   19,   05, 43),//РѕРєС‚СЏР±СЂСЊ
	new Date(1933, 10,   17,   16, 22),//РЅРѕСЏР±СЂСЊ
	new Date(1933, 11,   17,  02, 51),//РґРµРєР°Р±СЂСЊ	
//1934
	new Date(1934, 0,   15,   13, 36),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1934, 1,   14,   00, 42),//С„РµРІСЂР°Р»СЊ
	new Date(1934, 2,   15,   12, 07),//РјР°СЂС‚
	new Date(1934, 3,   13,   23, 56),//Р°РїСЂРµР»СЊ  
	new Date(1934, 4,   13,   12, 29),//РјР°Р№
	new Date(1934, 5,   12,   02, 10),//РёСЋРЅСЊ
	new Date(1934, 6,   11,   17, 04),//РёСЋР»СЊ
	new Date(1934, 7,   10,   08, 44),//Р°РІРіСѓСЃС‚
	new Date(1934, 8,   09,   00, 18),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1934, 9,   08,   15, 03),//РѕРєС‚СЏР±СЂСЊ
	new Date(1934, 10,   07,   04, 42),//РЅРѕСЏР±СЂСЊ
	new Date(1934, 11,   06,  17, 23),//РґРµРєР°Р±СЂСЊ	
//1935
	new Date(1935, 0,   05,   05, 19),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1935, 1,   03,   16, 26),//С„РµРІСЂР°Р»СЊ
	new Date(1935, 2,   05,   02, 39),//РјР°СЂС‚
	new Date(1935, 3,   03,   12, 09),//Р°РїСЂРµР»СЊ  
	new Date(1935, 4,   02,   21, 35),//РјР°Р№
	new Date(1935, 5,   01,   07, 51),//РёСЋРЅСЊ
	new Date(1935, 5,   30,   19, 43),//РёСЋРЅСЊ
	new Date(1935, 6,   30,   09, 31),//РёСЋР»СЊ
	new Date(1935, 7,   29,   00, 59),//Р°РІРіСѓСЃС‚
	new Date(1935, 8,   27,   17, 28),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1935, 9,   27,   10, 14),//РѕРєС‚СЏР±СЂСЊ
	new Date(1935, 10,   26,   02, 34),//РЅРѕСЏР±СЂСЊ
	new Date(1935, 11,   25,  17, 48),//РґРµРєР°Р±СЂСЊ	
//1936
	new Date(1936, 0,   24,   07, 16),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1936, 1,   22,   18, 41),//С„РµРІСЂР°Р»СЊ
	new Date(1936, 2,   23,   04, 12),//РјР°СЂС‚
	new Date(1936, 3,   21,   12, 31),//Р°РїСЂРµР»СЊ  
	new Date(1936, 4,   20,   20, 33),//РјР°Р№
	new Date(1936, 5,   19,   05, 13),//РёСЋРЅСЊ
	new Date(1936, 6,   18,   15, 17),//РёСЋР»СЊ
	new Date(1936, 7,   17,   03, 19),//Р°РІРіСѓСЃС‚
	new Date(1936, 8,   15,   17, 40),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1936, 9,   15,   10, 19),//РѕРєС‚СЏР±СЂСЊ
	new Date(1936, 10,   14,   04, 41),//РЅРѕСЏР±СЂСЊ
	new Date(1936, 11,   13,  23, 23),//РґРµРєР°Р±СЂСЊ	
//1937
	new Date(1937, 0,   12,   16, 45),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1937, 1,   11,   07, 33),//С„РµРІСЂР°Р»СЊ
	new Date(1937, 2,   12,   19, 30),//РјР°СЂС‚
	new Date(1937, 3,   11,   05, 08),//Р°РїСЂРµР»СЊ  
	new Date(1937, 4,   10,   13, 16),//РјР°Р№
	new Date(1937, 5,   08,   20, 41),//РёСЋРЅСЊ
	new Date(1937, 6,   08,   04, 11),//РёСЋР»СЊ
	new Date(1937, 7,   06,   12, 36),//Р°РІРіСѓСЃС‚
	new Date(1937, 8,   04,   22, 52),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1937, 9,   04,   11, 56),//РѕРєС‚СЏР±СЂСЊ
	new Date(1937, 10,   03,   04, 15),//РЅРѕСЏР±СЂСЊ
	new Date(1937, 11,   02,  23, 09),//РґРµРєР°Р±СЂСЊ	
//1938
	new Date(1938, 0,   01,   18, 57),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1938, 0,   31,   13, 34),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1938, 2,   02,   05, 38),//РјР°СЂС‚
	new Date(1938, 2,   31,   18, 50),//РјР°СЂС‚
	new Date(1938, 3,   30,   05, 26),//Р°РїСЂРµР»СЊ  
	new Date(1938, 4,   29,   13, 58),//РјР°Р№
	new Date(1938, 5,   27,   21, 08),//РёСЋРЅСЊ
	new Date(1938, 6,   27,   03, 52),//РёСЋР»СЊ
	new Date(1938, 7,   25,   11, 16),//Р°РІРіСѓСЃС‚
	new Date(1938, 8,   23,   20, 32),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1938, 9,   23,   08, 41),//РѕРєС‚СЏР±СЂСЊ
	new Date(1938, 10,   22,   00, 03),//РЅРѕСЏР±СЂСЊ
	new Date(1938, 11,   21,  18, 05),//РґРµРєР°Р±СЂСЊ	
//1939
	new Date(1939, 0,   20,   13, 25),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1939, 1,   19,   08, 26),//С„РµРІСЂР°Р»СЊ
	new Date(1939, 2,   21,   01, 48),//РјР°СЂС‚
	new Date(1939, 3,   19,   16, 33),//Р°РїСЂРµР»СЊ  
	new Date(1939, 4,   19,   04, 23),//РјР°Р№
	new Date(1939, 5,   17,   13, 35),//РёСЋРЅСЊ
	new Date(1939, 6,   16,   21, 01),//РёСЋР»СЊ
	new Date(1939, 7,   15,   03, 52),//Р°РІРіСѓСЃС‚
	new Date(1939, 8,   13,   11, 20),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1939, 9,   12,   20, 28),//РѕРєС‚СЏР±СЂСЊ
	new Date(1939, 10,   11,   07, 53),//РЅРѕСЏР±СЂСЊ
	new Date(1939, 11,   10,  21, 44),//РґРµРєР°Р±СЂСЊ	
//1940
	new Date(1940, 0,   09,   13, 51),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1940, 1,   08,   07, 43),//С„РµРІСЂР°Р»СЊ
	new Date(1940, 2,   09,   02, 21),//РјР°СЂС‚
	new Date(1940, 3,   07,   20, 17),//Р°РїСЂРµР»СЊ  
	new Date(1940, 4,   07,   12, 05),//РјР°Р№
	new Date(1940, 5,   06,   01, 03),//РёСЋРЅСЊ
	new Date(1940, 6,   05,   11, 26),//РёСЋР»СЊ
	new Date(1940, 7,   03,   20, 08),//Р°РІРіСѓСЃС‚
	new Date(1940, 8,   02,   04, 14),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1940, 9,   01,   12, 39),//РѕРєС‚СЏР±СЂСЊ
	new Date(1940, 9,   30,   22, 01),//РѕРєС‚СЏР±СЂСЊ!!!!!!
	new Date(1940, 10,   29,   08, 41),//РЅРѕСЏР±СЂСЊ
	new Date(1940, 11,   28,  20, 54),//РґРµРєР°Р±СЂСЊ	
//1941
	new Date(1941, 0,   27,   11, 01),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1941, 1,   26,   03, 01),//С„РµРІСЂР°Р»СЊ
	new Date(1941, 2,   27,   20, 12),//РјР°СЂС‚
	new Date(1941, 3,   26,   13, 22),//Р°РїСЂРµР»СЊ  
	new Date(1941, 4,   24,   05, 17),//РјР°Р№
	new Date(1941, 5,   24,   19, 21),//РёСЋРЅСЊ
	new Date(1941, 6,   22,   07, 37),//РёСЋР»СЊ
	new Date(1941, 7,   21,   18, 33),//Р°РІРіСѓСЃС‚
	new Date(1941, 8,   20,   04, 37),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1941, 9,   20,   14, 18),//РѕРєС‚СЏР±СЂСЊ
	new Date(1941, 10,   19,   00, 02),//РЅРѕСЏР±СЂСЊ
	new Date(1941, 11,   18,  10, 17),//РґРµРєР°Р±СЂСЊ	
//1942
	new Date(1942, 0,   16,   21, 30),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1942, 1,   15,   10, 01),//С„РµРІСЂР°Р»СЊ
	new Date(1942, 2,   16,   23, 48),//РјР°СЂС‚
	new Date(1942, 3,   15,   14, 32),//Р°РїСЂРµР»СЊ  
	new Date(1942, 4,   15,   05, 43),//РјР°Р№
	new Date(1942, 5,   13,   21, 00),//РёСЋРЅСЊ
	new Date(1942, 6,   13,   12, 01),//РёСЋР»СЊ
	new Date(1942, 7,   12,   02, 26),//Р°РІРіСѓСЃС‚
	new Date(1942, 8,   10,   15, 51),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1942, 9,   10,   04, 05),//РѕРєС‚СЏР±СЂСЊ
	new Date(1942, 10,  08,   15, 17),//РЅРѕСЏР±СЂСЊ
	new Date(1942, 11,  08,  01, 58),//РґРµРєР°Р±СЂСЊ	
//1943
	new Date(1943, 0,   06,   12, 36),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1943, 1,   04,   23, 27),//С„РµРІСЂР°Р»СЊ
	new Date(1943, 2,   06,   10, 32),//РјР°СЂС‚
	new Date(1943, 3,   04,   21, 51),//Р°РїСЂРµР»СЊ  
	new Date(1943, 4,   04,   09, 41),//РјР°Р№
	new Date(1943, 5,   02,   22, 31),//РёСЋРЅСЊ
	new Date(1943, 6,   02,   12, 42),//РёСЋР»СЊ
	new Date(1943, 7,   01,   04, 04),//Р°РІРіСѓСЃС‚
	new Date(1943, 7,   30,   19, 58),//Р°РІРіСѓСЃС‚!!!!!
	new Date(1943, 8,   29,   11, 27),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1943, 9,   29,   01, 57),//РѕРєС‚СЏР±СЂСЊ
	new Date(1943, 10,  27,   15, 21),//РЅРѕСЏР±СЂСЊ
	new Date(1943, 11,  27,  03, 49),//РґРµРєР°Р±СЂСЊ	
//1944
	new Date(1944, 0,   25,   15, 23),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1944, 1,   24,   01, 57),//С„РµРІСЂР°Р»СЊ
	new Date(1944, 2,   24,   11, 35),//РјР°СЂС‚
	new Date(1944, 3,   22,   20, 42),//Р°РїСЂРµР»СЊ  
	new Date(1944, 4,   22,   06, 11),//РјР°Р№
	new Date(1944, 5,   20,   16, 58),//РёСЋРЅСЊ
	new Date(1944, 6,   20,   05, 41),//РёСЋР»СЊ
	new Date(1944, 7,   18,   20, 23),//Р°РІРіСѓСЃС‚
	new Date(1944, 8,   17,   12, 36),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1944, 9,   17,   05, 33),//РѕРєС‚СЏР±СЂСЊ
	new Date(1944, 10,   15,   22, 28),//РЅРѕСЏР±СЂСЊ
	new Date(1944, 11,  15,  14, 33),//РґРµРєР°Р±СЂСЊ	
//1945
	new Date(1945, 0,   16,   21, 30),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1945, 1,   15,   10, 01),//С„РµРІСЂР°Р»СЊ
	new Date(1945, 2,   16,   23, 48),//РјР°СЂС‚
	new Date(1945, 3,   15,   14, 32),//Р°РїСЂРµР»СЊ  
	new Date(1945, 4,   15,   05, 43),//РјР°Р№
	new Date(1945, 5,   13,   21, 00),//РёСЋРЅСЊ
	new Date(1945, 6,   13,   12, 01),//РёСЋР»СЊ
	new Date(1945, 7,   12,   02, 26),//Р°РІРіСѓСЃС‚
	new Date(1945, 8,   10,   15, 51),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1945, 9,   10,   04, 05),//РѕРєС‚СЏР±СЂСЊ
	new Date(1945, 10,   08,   15, 17),//РЅРѕСЏР±СЂСЊ
	new Date(1945, 11,  08,  01, 58),//РґРµРєР°Р±СЂСЊ	
//1946
	new Date(1946, 0,   03,   12, 28),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1946, 1,   02,   04, 42),//С„РµРІСЂР°Р»СЊ
	new Date(1946, 2,   03,   18, 00),//РјР°СЂС‚
	new Date(1946, 3,   02,   04, 36),//Р°РїСЂРµР»СЊ  
	new Date(1946, 4,   01,   13, 15),//РјР°Р№
	new Date(1946, 4,   30,   20, 48),//РјР°Р№
	new Date(1946, 5,   29,   04, 04),//РёСЋРЅСЊ
	new Date(1946, 6,   28,   11, 52),//РёСЋР»СЊ
	new Date(1946, 7,   26,   21, 06),//Р°РІРіСѓСЃС‚
	new Date(1946, 8,   25,   08, 43),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1946, 9,   24,   23, 30),//РѕРєС‚СЏР±СЂСЊ
	new Date(1946, 10,  23,   17, 22),//РЅРѕСЏР±СЂСЊ
	new Date(1946, 11,  23,  13, 04),//РґРµРєР°Р±СЂСЊ	
//1947
	new Date(1947, 0,   22,   08, 33),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1947, 1,   21,   01, 59),//С„РµРІСЂР°Р»СЊ
	new Date(1947, 2,   22,   16, 32),//РјР°СЂС‚
	new Date(1947, 3,   21,   04, 17),//Р°РїСЂРµР»СЊ  
	new Date(1947, 4,   20,   13, 42),//РјР°Р№
	new Date(1947, 5,   18,   21, 25),//РёСЋРЅСЊ
	new Date(1947, 6,   18,   04, 14),//РёСЋР»СЊ
	new Date(1947, 7,   16,   11, 11),//Р°РІРіСѓСЃС‚
	new Date(1947, 8,   14,   19, 26),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1947, 9,   14,   06, 08),//РѕРєС‚СЏР±СЂСЊ
	new Date(1947, 10,  12,   19, 59),//РЅРѕСЏР±СЂСЊ
	new Date(1947, 11,  12,  12, 52),//РґРµРєР°Р±СЂСЊ	
//1948
	new Date(1948, 0,   11,   07, 43),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1948, 1,   10,   03, 00),//С„РµРІСЂР°Р»СЊ
	new Date(1948, 2,   10,   21, 13),//РјР°СЂС‚
	new Date(1948, 3,   09,   13, 15),//Р°РїСЂРµР»СЊ  
	new Date(1948, 4,   09,   02, 29),//РјР°Р№
	new Date(1948, 5,   07,   12, 54),//РёСЋРЅСЊ
	new Date(1948, 6,   06,   21, 07),//РёСЋР»СЊ
	new Date(1948, 7,   05,   04, 11),//Р°РІРіСѓСЃС‚
	new Date(1948, 8,   03,   11, 20),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1948, 9,   02,   19, 40),//РѕРєС‚СЏР±СЂСЊ
	new Date(1948, 10,  01,   06, 01),//РЅРѕСЏР±СЂСЊ
	new Date(1948, 10,  30,   18, 43),//РЅРѕСЏР±СЂСЊ!!!!!
	new Date(1948, 11,  30,  09, 43),//РґРµРєР°Р±СЂСЊ	
//1949
	new Date(1949, 0,   29,   02, 41),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1949, 1,   27,   20, 53),//С„РµРІСЂР°Р»СЊ
	new Date(1949, 2,   29,   15, 09),//РјР°СЂС‚
	new Date(1949, 3,   28,   08, 01),//Р°РїСЂРµР»СЊ  
	new Date(1949, 4,   27,   22, 22),//РјР°Р№
	new Date(1949, 5,   26,   10, 01),//РёСЋРЅСЊ
	new Date(1949, 6,   25,   19, 32),//РёСЋР»СЊ
	new Date(1949, 7,   24,   03, 58),//Р°РІРіСѓСЃС‚
	new Date(1949, 8,   22,   12, 20),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1949, 9,   21,   21, 21),//РѕРєС‚СЏР±СЂСЊ
	new Date(1949, 10,  20,   07, 28),//РЅРѕСЏР±СЂСЊ
	new Date(1949, 11,  19,   18, 54),//РґРµРєР°Р±СЂСЊ	
//1950
	new Date(1950, 0,   18,   07, 58),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1950, 1,   16,   22, 52),//С„РµРІСЂР°Р»СЊ
	new Date(1950, 2,   18,   15, 19),//РјР°СЂС‚
	new Date(1950, 3,   17,   08, 24),//Р°РїСЂРµР»СЊ  
	new Date(1950, 4,   17,   00, 53),//РјР°Р№
	new Date(1950, 5,   15,   15, 51),//РёСЋРЅСЊ
	new Date(1950, 6,   15,   05, 04),//РёСЋР»СЊ
	new Date(1950, 7,   13,   16, 47),//Р°РІРіСѓСЃС‚
	new Date(1950, 8,   12,   03, 27),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1950, 9,   11,   13, 32),//РѕРєС‚СЏР±СЂСЊ
	new Date(1950, 10,  09,   23, 24),//РЅРѕСЏР±СЂСЊ
	new Date(1950, 11,  09,   09, 27),//РґРµРєР°Р±СЂСЊ	
//1951
	new Date(1951, 0,   07,   20, 08),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1951, 1,   06,   07, 52),//С„РµРІСЂР°Р»СЊ
	new Date(1951, 2,   07,   20, 49),//РјР°СЂС‚
	new Date(1951, 3,   06,   10, 50),//Р°РїСЂРµР»СЊ  
	new Date(1951, 4,   06,   01, 34),//РјР°Р№
	new Date(1951, 5,   04,   16, 39),//РёСЋРЅСЊ
	new Date(1951, 6,   04,   07, 46),//РёСЋР»СЊ
	new Date(1951, 7,   02,   22, 38),//Р°РІРіСѓСЃС‚
	new Date(1951, 8,   01,   12, 48),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1951, 9,   01,   01, 55),//РѕРєС‚СЏР±СЂСЊ
	new Date(1951, 9,   30,   13, 53),//РѕРєС‚СЏР±СЂСЊ!!!
	new Date(1951, 10,  29,   00, 59),//РЅРѕСЏР±СЂСЊ
	new Date(1951, 11,  28,   11, 42),//РґРµРєР°Р±СЂСЊ	
//1952
	new Date(1952, 0,   26,   22, 25),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1952, 1,   25,   09, 14),//С„РµРІСЂР°Р»СЊ
	new Date(1952, 2,   25,   20, 11),//РјР°СЂС‚
	new Date(1952, 3,   24,   07, 26),//Р°РїСЂРµР»СЊ  
	new Date(1952, 4,   23,   19, 26),//РјР°Р№
	new Date(1952, 5,   22,   08, 44),//РёСЋРЅСЊ
	new Date(1952, 6,   21,   23, 29),//РёСЋР»СЊ
	new Date(1952, 7,   20,   15, 19),//Р°РІРіСѓСЃС‚
	new Date(1952, 8,   19,   07, 20),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1952, 9,   18,   22, 41),//РѕРєС‚СЏР±СЂСЊ
	new Date(1952, 10,  17,   12, 54),//РЅРѕСЏР±СЂСЊ
	new Date(1952, 11,  17,   02, 01),//РґРµРєР°Р±СЂСЊ		
//1953
	new Date(1953, 0,   15,   14, 07),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1953, 1,   14,   01, 09),//С„РµРІСЂР°Р»СЊ
	new Date(1953, 2,   15,   11, 04),//РјР°СЂС‚
	new Date(1953, 3,   13,   20, 08),//Р°РїСЂРµР»СЊ  
	new Date(1953, 4,   13,   05, 04),//РјР°Р№
	new Date(1953, 5,   11,   14, 53),//РёСЋРЅСЊ
	new Date(1953, 6,   11,   02, 27),//РёСЋР»СЊ
	new Date(1953, 7,   09,   16, 09),//Р°РІРіСѓСЃС‚
	new Date(1953, 8,   08,   07, 46),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1953, 9,   08,   00, 39),//РѕРєС‚СЏР±СЂСЊ
	new Date(1953, 10,  06,   17, 56),//РЅРѕСЏР±СЂСЊ
	new Date(1953, 11,  06,   10, 47),//РґРµРєР°Р±СЂСЊ	
//1954
	new Date(1954, 0,   05,   02, 20),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1954, 1,   03,   15, 54),//С„РµРІСЂР°Р»СЊ
	new Date(1954, 2,   05,   03, 10),//РјР°СЂС‚
	new Date(1954, 3,   03,   12, 24),//Р°РїСЂРµР»СЊ  
	new Date(1954, 4,   02,   20, 21),//РјР°Р№
	new Date(1954, 5,   01,   04, 01),//РёСЋРЅСЊ
	new Date(1954, 5,   30,   12, 24),//РёСЋРЅСЊ!!!!!!
	new Date(1954, 6,   29,   22, 18),//РёСЋР»СЊ
	new Date(1954, 7,   28,   10, 20),//Р°РІРіСѓСЃС‚
	new Date(1954, 8,   27,   00, 49),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1954, 9,   26,   17, 45),//РѕРєС‚СЏР±СЂСЊ
	new Date(1954, 10,  25,   12, 29),//РЅРѕСЏР±СЂСЊ
	new Date(1954, 11,  25,   07, 32),//РґРµРєР°Р±СЂСЊ	
//1955
	new Date(1955, 0,   24,   01, 05),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1955, 1,   22,   15, 53),//С„РµРІСЂР°Р»СЊ
	new Date(1955, 2,   24,   03, 41),//РјР°СЂС‚
	new Date(1955, 3,   22,   13, 04),//Р°РїСЂРµР»СЊ  
	new Date(1955, 4,   21,   20, 57),//РјР°Р№
	new Date(1955, 5,   20,   04, 10),//РёСЋРЅСЊ
	new Date(1955, 6,   19,   11, 33),//РёСЋР»СЊ
	new Date(1955, 7,   17,   19, 57),//Р°РІРіСѓСЃС‚
	new Date(1955, 8,   16,   06, 18),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1955, 9,   15,   19, 31),//РѕРєС‚СЏР±СЂСЊ
	new Date(1955, 10,  14,   12, 00),//РЅРѕСЏР±СЂСЊ
	new Date(1955, 11,  14,   07, 06),//РґРµРєР°Р±СЂСЊ	
//1956
	new Date(1956, 0,   13,   02, 59),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1956, 1,   11,   21, 36),//С„РµРІСЂР°Р»СЊ
	new Date(1956, 2,   12,   13, 35),//РјР°СЂС‚
	new Date(1956, 3,   11,   02, 37),//Р°РїСЂРµР»СЊ  
	new Date(1956, 4,   10,   13, 03),//РјР°Р№
	new Date(1956, 5,   08,   21, 27),//РёСЋРЅСЊ
	new Date(1956, 6,   08,   04, 36),//РёСЋР»СЊ
	new Date(1956, 7,   06,   11, 23),//Р°РІРіСѓСЃС‚
	new Date(1956, 8,   04,   18, 56),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1956, 9,   04,   04, 23),//РѕРєС‚СЏР±СЂСЊ
	new Date(1956, 10,  02,   16, 42),//РЅРѕСЏР±СЂСЊ
	new Date(1956, 11,  02,   08, 11),//РґРµРєР°Р±СЂСЊ	
//1957
	new Date(1957, 0,   01,   02, 12),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1957, 0,   30,   21, 23),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ!!!!!!!!!1
	new Date(1957, 2,   01,   16, 11),//РјР°СЂС‚!!!!!!!!!!!!!!
	new Date(1957, 2,   31,   09, 18),//РјР°СЂС‚
	new Date(1957, 3,   29,   23, 52),//Р°РїСЂРµР»СЊ  
	new Date(1957, 4,   29,   11, 37),//РјР°Р№
	new Date(1957, 5,   27,   20, 52),//РёСЋРЅСЊ
	new Date(1957, 6,   27,   04, 26),//РёСЋР»СЊ
	new Date(1957, 7,   25,   11, 31),//Р°РІРіСѓСЃС‚
	new Date(1957, 8,   23,   19, 17),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1957, 9,   23,   04, 42),//РѕРєС‚СЏР±СЂСЊ
	new Date(1957, 10,  21,   16, 18),//РЅРѕСЏР±СЂСЊ
	new Date(1957, 11,  21,   06, 10),//РґРµРєР°Р±СЂСЊ	
//1958
	new Date(1958, 0,   19,   22, 06),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1958, 1,   18,   15, 37),//С„РµРІСЂР°Р»СЊ
	new Date(1958, 2,   20,   09, 48),//РјР°СЂС‚
	new Date(1958, 3,   19,   03, 22),//Р°РїСЂРµР»СЊ  
	new Date(1958, 4,   18,   18, 59),//РјР°Р№
	new Date(1958, 5,   17,   07, 58),//РёСЋРЅСЊ
	new Date(1958, 6,   16,   18, 32),//РёСЋР»СЊ
	new Date(1958, 7,   15,   03, 32),//Р°РІРіСѓСЃС‚
	new Date(1958, 8,   13,   12, 00),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1958, 9,   12,   20, 50),//РѕРєС‚СЏР±СЂСЊ
	new Date(1958, 10,  11,   06, 32),//РЅРѕСЏР±СЂСЊ
	new Date(1958, 11,  10,   17, 22),//РґРµРєР°Р±СЂСЊ	
//1959
	new Date(1959, 0,   09,   02, 59),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1959, 1,   07,   21, 36),//С„РµРІСЂР°Р»СЊ
	new Date(1959, 2,   09,   13, 35),//РјР°СЂС‚
	new Date(1959, 3,   08,   02, 37),//Р°РїСЂРµР»СЊ  
	new Date(1959, 4,   07,   13, 03),//РјР°Р№
	new Date(1959, 5,   06,   21, 27),//РёСЋРЅСЊ
	new Date(1959, 6,   06,   04, 36),//РёСЋР»СЊ
	new Date(1959, 7,   04,   11, 23),//Р°РІРіСѓСЃС‚
	new Date(1959, 8,   03,   18, 56),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1959, 9,   02,   04, 23),//РѕРєС‚СЏР±СЂСЊ
	new Date(1959, 9,   31,   04, 23),//РѕРєС‚СЏР±СЂСЊ!!!!!!
	new Date(1959, 10,  30,   16, 42),//РЅРѕСЏР±СЂСЊ
	new Date(1959, 11,  29,   08, 11),//РґРµРєР°Р±СЂСЊ	
//1960
	new Date(1960, 0,   28,   06, 14),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1960, 1,   26,   18, 22),//С„РµРІСЂР°Р»СЊ
	new Date(1960, 2,   27,   07, 36),//РјР°СЂС‚
	new Date(1960, 3,   25,   21, 43),//Р°РїСЂРµР»СЊ  
	new Date(1960, 4,   25,   12, 24),//РјР°Р№
	new Date(1960, 5,   25,   03, 25),//РёСЋРЅСЊ
	new Date(1960, 6,   24,   18, 29),//РёСЋР»СЊ
	new Date(1960, 7,   23,   09, 14),//Р°РІРіСѓСЃС‚
	new Date(1960, 8,   22,   23, 11),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1960, 9,   20,   12, 01),//РѕРєС‚СЏР±СЂСЊ
	new Date(1960, 10,  18,   23, 45),//РЅРѕСЏР±СЂСЊ
	new Date(1960, 11,  18,   10, 45),//РґРµРєР°Р±СЂСЊ	
//1961
	new Date(1961, 0,   16,   21, 28),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1961, 1,   15,   08, 09),//С„РµРІСЂР°Р»СЊ
	new Date(1961, 2,   16,   18, 49),//РјР°СЂС‚
	new Date(1961, 3,   15,   05, 36),//Р°РїСЂРµР»СЊ  
	new Date(1961, 4,   14,   16, 53),//РјР°Р№
	new Date(1961, 5,   13,   05, 15),//РёСЋРЅСЊ
	new Date(1961, 6,   12,   19, 10),//РёСЋР»СЊ
	new Date(1961, 7,   11,   10, 34),//Р°РІРіСѓСЃС‚
	new Date(1961, 8,   10,   02, 48),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1961, 9,   09,   18, 51),//РѕРєС‚СЏР±СЂСЊ
	new Date(1961, 10,  08,   09, 57),//РЅРѕСЏР±СЂСЊ
	new Date(1961, 11,  07,   23, 50),//РґРµРєР°Р±СЂСЊ	
//1962
	new Date(1962, 0,   06,   12, 34),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1962, 1,   05,   00, 08),//С„РµРІСЂР°Р»СЊ
	new Date(1962, 2,   06,   10, 29),//РјР°СЂС‚
	new Date(1962, 3,   04,   19, 43),//Р°РїСЂРµР»СЊ  
	new Date(1962, 4,   04,   04, 23),//РјР°Р№
	new Date(1962, 5,   02,   13, 25),//РёСЋРЅСЊ
	new Date(1962, 6,   01,   23, 51),//РёСЋР»СЊ
	new Date(1962, 6,   31,   12, 22),//РёСЋР»СЊ
	new Date(1962, 7,   30,   03, 07),//Р°РІРіСѓСЃС‚
	new Date(1962, 8,   28,   19, 38),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1962, 9,   28,   13, 03),//РѕРєС‚СЏР±СЂСЊ
	new Date(1962, 10,  27,   06, 28),//РЅРѕСЏР±СЂСЊ
	new Date(1962, 11,  26,   22, 57),//РґРµРєР°Р±СЂСЊ	

//1963
	new Date(1963, 0,   25,   13, 40),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1963, 1,   24,   02, 04),//С„РµРІСЂР°Р»СЊ
	new Date(1963, 2,   25,   12, 08),//РјР°СЂС‚
	new Date(1963, 3,   23,   20, 27),//Р°РїСЂРµР»СЊ  
	new Date(1963, 4,   23,   03, 58),//РјР°Р№
	new Date(1963, 5,   21,   11, 44),//РёСЋРЅСЊ
	new Date(1963, 6,   20,   20, 41),//РёСЋР»СЊ
	new Date(1963, 7,   19,   07, 33),//Р°РІРіСѓСЃС‚
	new Date(1963, 8,   17,   20, 49),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1963, 9,   17,   12, 41),//РѕРєС‚СЏР±СЂСЊ
	new Date(1963, 10,  16,   06, 49),//РЅРѕСЏР±СЂСЊ
	new Date(1963, 11,  16,   02, 05),//РґРµРєР°Р±СЂСЊ
//1964
	new Date(1964, 0,   14,   20, 42),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1964, 1,   13,   13, 00),//С„РµРІСЂР°Р»СЊ
	new Date(1964, 2,   14,   02, 12),//РјР°СЂС‚
	new Date(1964, 3,   12,   12, 36),//Р°РїСЂРµР»СЊ  
	new Date(1964, 4,   11,   21, 00),//РјР°Р№
	new Date(1964, 5,   10,   04, 21),//РёСЋРЅСЊ
	new Date(1964, 6,   09,   11, 29),//РёСЋР»СЊ
	new Date(1964, 7,   07,   19, 15),//Р°РІРіСѓСЃС‚
	new Date(1964, 8,   06,   04, 33),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1964, 9,   05,   16, 18),//РѕРєС‚СЏР±СЂСЊ
	new Date(1964, 10,  04,   07, 15),//РЅРѕСЏР±СЂСЊ
	new Date(1964, 11,  04,   01, 17),//РґРµРєР°Р±СЂ
//1965
	new Date(1965, 0,   02,   21, 05),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1965, 1,   01,   16, 34),//С„РµРІСЂР°Р»СЊ
	new Date(1965, 2,   03,   09, 55),//РјР°СЂС‚
	new Date(1965, 3,   02,   00, 19),//Р°РїСЂРµР»СЊ  
	new Date(1965, 4,   01,   11, 54),//РјР°Р№
	new Date(1965, 4,   30,   21, 11),//РјР°Р№!!!!!!!!
	new Date(1965, 5,   29,   04, 51),//РёСЋРЅСЊ
	new Date(1965, 6,   28,   11, 43),//РёСЋР»СЊ
	new Date(1965, 7,   26,   18, 49),//Р°РІРіСѓСЃС‚
	new Date(1965, 8,   25,   03, 16),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1965, 9,   24,   14, 10),//РѕРєС‚СЏР±СЂСЊ
	new Date(1965, 10,  23,   04, 09),//РЅРѕСЏР±СЂСЊ
	new Date(1965, 11,  22,   21, 02),//РґРµРєР°Р±СЂСЊ
//1966
	new Date(1966, 0,   21,   15, 45),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1966, 1,   20,   10, 48),//С„РµРІСЂР°Р»СЊ
	new Date(1966, 2,   22,   04, 45),//РјР°СЂС‚
	new Date(1966, 3,   20,   20, 33),//Р°РїСЂРµР»СЊ  
	new Date(1966, 4,   20,   09, 41),//РјР°Р№
	new Date(1966, 5,   18,   20, 07),//РёСЋРЅСЊ
	new Date(1966, 6,   18,   04, 29),//РёСЋР»СЊ
	new Date(1966, 7,   16,   11, 46),//Р°РІРіСѓСЃС‚
	new Date(1966, 8,   14,   19, 12),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1966, 9,   14,   03, 50),//РѕРєС‚СЏР±СЂСЊ
	new Date(1966, 10,  12,   14, 25),//РЅРѕСЏР±СЂСЊ
	new Date(1966, 11,  12,   03, 12),//РґРµРєР°Р±СЂ
//1967
	new Date(1967, 0,   10,   18, 04),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1967, 1,   09,   10, 42),//С„РµРІСЂР°Р»СЊ
	new Date(1967, 2,   11,   04, 28),//РјР°СЂС‚
	new Date(1967, 3,   09,   22, 19),//Р°РїСЂРµР»СЊ  
	new Date(1967, 4,   09,   14, 54),//РјР°Р№
	new Date(1967, 5,   08,   05, 12),//РёСЋРЅСЊ
	new Date(1967, 6,   07,   16, 58),//РёСЋР»СЊ
	new Date(1967, 7,   06,   02, 47),//Р°РІРіСѓСЃС‚
	new Date(1967, 8,   04,   11, 35),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1967, 9,   03,   20, 22),//РѕРєС‚СЏР±СЂСЊ
	new Date(1967, 10,  02,   05, 47),//РЅРѕСЏР±СЂСЊ
	new Date(1967, 11,  01,   16, 08),//РґРµРєР°Р±СЂ
	new Date(1967, 11,  31,   03, 37),//РґРµРєР°Р±СЂ
//1968
	new Date(1968, 0,   29,   16, 28),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1968, 1,   28,   06, 54),//С„РµРІСЂР°Р»СЊ
	new Date(1968, 2,   28,   22, 47),//РјР°СЂС‚
	new Date(1968, 3,   27,   15, 20),//Р°РїСЂРµР»СЊ  
	new Date(1968, 4,   27,   07, 28),//РјР°Р№
	new Date(1968, 5,   25,   22, 23),//РёСЋРЅСЊ
	new Date(1968, 6,   25,   11, 48),//РёСЋР»СЊ
	new Date(1968, 7,   23,   23, 55),//Р°РІРіСѓСЃС‚
	new Date(1968, 8,   22,   11, 07),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1968, 9,   21,   21, 43),//РѕРєС‚СЏР±СЂСЊ
	new Date(1968, 10,  20,   08, 00),//РЅРѕСЏР±СЂСЊ
	new Date(1968, 11,  19,   18, 17),//РґРµРєР°Р±СЂ
//1969
	new Date(1969, 0,   18,   04, 57),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1969, 1,   16,   16, 24),//С„РµРІСЂР°Р»СЊ
	new Date(1969, 2,   18,   04, 50),//РјР°СЂС‚
	new Date(1969, 3,   16,   18, 14),//Р°РїСЂРµР»СЊ  
	new Date(1969, 4,   16,   08, 25),//РјР°Р№
	new Date(1969, 5,   14,   23, 07),//РёСЋРЅСЊ
	new Date(1969, 6,   14,   14, 10),//РёСЋР»СЊ
	new Date(1969, 7,   13,   05, 15),//Р°РІРіСѓСЃС‚
	new Date(1969, 8,   11,   19, 54),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1969, 9,   11,   09, 38),//РѕРєС‚СЏР±СЂСЊ
	new Date(1969, 10,  09,   22, 10),//РЅРѕСЏР±СЂСЊ
	new Date(1969, 11,  09,   09, 40),//РґРµРєР°Р±СЂСЊ
//1970
	new Date(1970, 0,   07,   20, 34),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1970, 1,   06,   07, 11),//С„РµРІСЂР°Р»СЊ
	new Date(1970, 2,   07,   17, 41),//РјР°СЂС‚
	new Date(1970, 3,   06,   04, 08),//Р°РїСЂРµР»СЊ  
	new Date(1970, 4,   05,   14, 49),//РјР°Р№
	new Date(1970, 5,   04,   02, 20),//РёСЋРЅСЊ
	new Date(1970, 6,   03,   15, 16),//РёСЋР»СЊ
	new Date(1970, 7,   02,   05, 57),//Р°РІРіСѓСЃС‚
	new Date(1970, 7,   31,   22, 00),//Р°РІРіСѓСЃС‚
	new Date(1970, 8,   30,   14, 30),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1970, 9,   30,   06, 26),//РѕРєС‚СЏР±СЂСЊ
	new Date(1970, 10,  28,   21, 13),//РЅРѕСЏР±СЂСЊ
	new Date(1970, 11,  28,   10, 41),//РґРµРєР°Р±СЂСЊ

//1971
	new Date(1971, 0,   26,   22, 53),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1971, 1,   25,   09, 47),//С„РµРІСЂР°Р»СЊ
	new Date(1971, 2,   26,   19, 22),//РјР°СЂС‚
	new Date(1971, 3,   25,   04, 00),//Р°РїСЂРµР»СЊ  
	new Date(1971, 4,   24,   12, 30),//РјР°Р№
	new Date(1971, 5,   22,   21, 56),//РёСЋРЅСЊ
	new Date(1971, 6,   22,   09, 14),//РёСЋР»СЊ
	new Date(1971, 7,   20,   22, 52),//Р°РІРіСѓСЃС‚
	new Date(1971, 8,   19,   14, 41),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1971, 9,   19,   07, 58),//РѕРєС‚СЏР±СЂСЊ
	new Date(1971, 10,  18,   01, 44),//РЅРѕСЏР±СЂСЊ
	new Date(1971, 11,  17,   19, 01),//РґРµРєР°Р±СЂСЊ
//1972
	new Date(1972, 0,   16,   10, 51),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1972, 1,   15,   00, 27),//С„РµРІСЂР°Р»СЊ
	new Date(1972, 2,   15,   11, 33),//РјР°СЂС‚
	new Date(1972, 3,   13,   20, 29),//Р°РїСЂРµР»СЊ  
	new Date(1972, 4,   13,   04, 06),//РјР°Р№
	new Date(1972, 5,   11,   11, 28),//РёСЋРЅСЊ
	new Date(1972, 6,   10,   19, 37),//РёСЋР»СЊ
	new Date(1972, 7,   09,   05, 24),//Р°РІРіСѓСЃС‚
	new Date(1972, 8,   07,   17, 27),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1972, 9,   07,   08, 06),//РѕРєС‚СЏР±СЂСЊ
	new Date(1972, 10,  06,   01, 20),//РЅРѕСЏР±СЂСЊ
	new Date(1972, 11,  05,   20, 23),//РґРµРєР°Р±СЂСЊ

//1973
	new Date(1973, 0,   04,   15, 41),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1973, 1,   03,   09, 21),//С„РµРІСЂР°Р»СЊ
	new Date(1973, 2,   05,   00, 06),//РјР°СЂС‚
	new Date(1973, 3,   03,   11, 43),//Р°РїСЂРµР»СЊ  
	new Date(1973, 4,   02,   20, 53),//РјР°Р№
	new Date(1973, 5,   01,   04, 33),//РёСЋРЅСЊ
	new Date(1973, 5,   30,   11, 37),//РёСЋРЅСЊ
	new Date(1973, 6,   29,   18, 57),//РёСЋР»СЊ
	new Date(1973, 7,   28,   03, 24),//Р°РІРіСѓСЃС‚
	new Date(1973, 8,   26,   13, 52),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1973, 9,   26,   03, 15),//РѕРєС‚СЏР±СЂСЊ
	new Date(1973, 10,  24,   11, 37),//РЅРѕСЏР±СЂСЊ
	new Date(1973, 11,  24,   15, 06),//РґРµРєР°Р±СЂСЊ

//1974
	new Date(1974, 0,   23,   11, 01),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1974, 1,   22,   05, 33),//С„РµРІСЂР°Р»СЊ
	new Date(1974, 2,   23,   21, 23),//РјР°СЂС‚
	new Date(1974, 3,   22,   10, 15),//Р°РїСЂРµР»СЊ  
	new Date(1974, 4,   21,   20, 33),//РјР°Р№
	new Date(1974, 5,   20,   04, 54),//РёСЋРЅСЊ
	new Date(1974, 6,   19,   12, 05),//РёСЋР»СЊ
	new Date(1974, 7,   17,   19, 00),//Р°РІРіСѓСЃС‚
	new Date(1974, 8,   16,   02, 44),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1974, 9,   15,   12, 23),//РѕРєС‚СЏР±СЂСЊ
	new Date(1974, 10,  14,   00, 52),//РЅРѕСЏР±СЂСЊ
	new Date(1974, 11,  13,   16, 23),//РґРµРєР°Р±СЂСЊ
//1975
	new Date(1975, 0,   12,   10, 18),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1975, 1,   11,   05, 16),//С„РµРІСЂР°Р»СЊ
	new Date(1975, 2,   12,   23, 46),//РјР°СЂС‚
	new Date(1975, 3,   11,   16, 38),//Р°РїСЂРµР»СЊ  
	new Date(1975, 4,   11,   07, 03),//РјР°Р№
	new Date(1975, 5,   09,   18, 47),//РёСЋРЅСЊ
	new Date(1975, 6,   09,   04, 08),//РёСЋР»СЊ
	new Date(1975, 7,   07,   11, 56),//Р°РІРіСѓСЃС‚
	new Date(1975, 8,   05,   19, 17),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1975, 9,   05,   03, 21),//РѕРєС‚СЏР±СЂСЊ
	new Date(1975, 10,  03,   13, 03),//РЅРѕСЏР±СЂСЊ
	new Date(1975, 11,  03,   00, 48),//РґРµРєР°Р±СЂСЊ
//1976
	new Date(1976, 0,   01,   14, 38),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1976, 0,   31,   06, 19),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1976, 1,   29,   23, 23),//С„РµРІСЂР°Р»СЊ
	new Date(1976, 2,   30,   17, 07),//РјР°СЂС‚
	new Date(1976, 3,   29,   10, 18),//Р°РїСЂРµР»СЊ  
	new Date(1976, 4,   29,   01, 45),//РјР°Р№
	new Date(1976, 5,   27,   14, 48),//РёСЋРЅСЊ
	new Date(1976, 6,   27,   01, 37),//РёСЋР»СЊ
	new Date(1976, 7,   25,   10, 59),//Р°РІРіСѓСЃС‚
	new Date(1976, 8,   23,   19, 53),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1976, 9,   23,   05, 08),//РѕРєС‚СЏР±СЂСЊ
	new Date(1976, 10,  21,   15, 09),//РЅРѕСЏР±СЂСЊ
	new Date(1976, 11,  21,   02, 06),//РґРµРєР°Р±СЂСЊ
//1977
	new Date(1977, 0,   19,   14, 10),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1977, 1,   18,   03, 36),//С„РµРІСЂР°Р»СЊ
	new Date(1977, 2,   19,   18, 32),//РјР°СЂС‚
	new Date(1977, 3,   18,   10, 34),//Р°РїСЂРµР»СЊ  
	new Date(1977, 4,   18,   02, 50),//РјР°Р№
	new Date(1977, 5,   16,   18, 21),//РёСЋРЅСЊ
	new Date(1977, 6,   16,   08, 35),//РёСЋР»СЊ
	new Date(1977, 7,   14,   21, 30),//Р°РІРіСѓСЃС‚
	new Date(1977, 8,   13,   09, 21),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1977, 9,   12,   20, 29),//РѕРєС‚СЏР±СЂСЊ
	new Date(1977, 10,  11,   07, 08),//РЅРѕСЏР±СЂСЊ
	new Date(1977, 11,  10,   17, 31),//РґРµРєР°Р±СЂСЊ
//1978
	new Date(1978, 0,   09,   03, 58),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1978, 1,   07,   14, 52),//С„РµРІСЂР°Р»СЊ
	new Date(1978, 2,   09,   02, 35),//РјР°СЂС‚
	new Date(1978, 3,   07,   15, 14),//Р°РїСЂРµР»СЊ  
	new Date(1978, 4,   07,   04, 45),//РјР°Р№
	new Date(1978, 5,   05,   19, 00),//РёСЋРЅСЊ
	new Date(1978, 6,   05,   09, 49),//РёСЋР»СЊ
	new Date(1978, 7,   04,   00, 59),//Р°РІРіСѓСЃС‚
	new Date(1978, 8,   02,   16, 07),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1978, 9,   02,   06, 39),//РѕРєС‚СЏР±СЂСЊ
	new Date(1978, 9,   31,   20, 05),//РѕРєС‚СЏР±СЂСЊ!!!!!!!
	new Date(1978, 10,  30,   08, 18),//РЅРѕСЏР±СЂСЊ
	new Date(1978, 11,  29,   19, 34),//РґРµРєР°Р±СЂСЊ
//1979
	new Date(1979, 0,   28,   06, 18),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1979, 1,   26,   16, 43),//С„РµРІСЂР°Р»СЊ
	new Date(1979, 2,   28,   02, 58),//РјР°СЂС‚
	new Date(1979, 3,   26,   13, 13),//Р°РїСЂРµР»СЊ  
	new Date(1979, 4,   25,   23, 59),//РјР°Р№
	new Date(1979, 5,   24,   11, 56),//РёСЋРЅСЊ
	new Date(1979, 6,   24,   01, 39),//РёСЋР»СЊ
	new Date(1979, 7,   22,   17, 09),//Р°РІРіСѓСЃС‚
	new Date(1979, 8,   21,   09, 45),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1979, 9,   21,   02, 21),//РѕРєС‚СЏР±СЂСЊ
	new Date(1979, 10,  19,   18, 02),//РЅРѕСЏР±СЂСЊ
	new Date(1979, 11,  19,   08, 22),//РґРµРєР°Р±СЂСЊ
//1980
	new Date(1980, 0,   17,   21, 18),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1980, 1,   16,   09, 49),//С„РµРІСЂР°Р»СЊ
	new Date(1980, 2,   16,   18, 54),//РјР°СЂС‚
	new Date(1980, 3,   15,   03, 45),//Р°РїСЂРµР»СЊ  
	new Date(1980, 4,   14,   11, 59),//РјР°Р№
	new Date(1980, 5,   12,   20, 37),//РёСЋРЅСЊ
	new Date(1980, 6,   12,   06, 44),//РёСЋР»СЊ
	new Date(1980, 7,   10,   19, 08),//Р°РІРіСѓСЃС‚
	new Date(1980, 8,   09,   09, 59),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1980, 9,   09,   02, 48),//РѕРєС‚СЏР±СЂСЊ
	new Date(1980, 10,  07,   20, 41),//РЅРѕСЏР±СЂСЊ
	new Date(1980, 11,  07,   14, 34),//РґРµРєР°Р±СЂСЊ
//1981
	new Date(1981, 0,   06,   07, 23),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1981, 1,   04,   22, 12),//С„РµРІСЂР°Р»СЊ
	new Date(1981, 2,   06,   10, 30),//РјР°СЂС‚
	new Date(1981, 3,   04,   20, 18),//Р°РїСЂРµР»СЊ  
	new Date(1981, 4,   04,   04, 18),//РјР°Р№
	new Date(1981, 5,   02,   11, 30),//РёСЋРЅСЊ
	new Date(1981, 6,   01,   19, 02),//РёСЋР»СЊ
	new Date(1981, 6,   31,   03, 51),//РёСЋР»СЊ
	new Date(1981, 7,   29,   14, 42),//Р°РІРіСѓСЃС‚
	new Date(1981, 8,   28,   04, 06),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1981, 9,   27,   20, 12),//РѕРєС‚СЏР±СЂСЊ
	new Date(1981, 10,  26,   14, 37),//РЅРѕСЏР±СЂСЊ
	new Date(1981, 11,  26,   10, 09),//РґРµРєР°Р±СЂСЊ
//1982
	new Date(1982, 0,   25,   04, 54),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1982, 1,   23,   21, 12),//С„РµРІСЂР°Р»СЊ
	new Date(1982, 2,   25,   10, 16),//РјР°СЂС‚
	new Date(1982, 3,   23,   20, 27),//Р°РїСЂРµР»СЊ  
	new Date(1982, 4,   23,   04, 39),//РјР°Р№
	new Date(1982, 5,   21,   11, 50),//РёСЋРЅСЊ
	new Date(1982, 6,   20,   18, 55),//РёСЋР»СЊ
	new Date(1982, 7,   19,   02, 44),//Р°РІРіСѓСЃС‚
	new Date(1982, 8,   17,   12, 08),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1982, 9,   17,   00, 02),//РѕРєС‚СЏР±СЂСЊ
	new Date(1982, 10,  15,   15, 08),//РЅРѕСЏР±СЂСЊ
	new Date(1982, 11,  15,   09, 17),//РґРµРєР°Р±СЂСЊ
//1983
	new Date(1983, 0,   14,   05, 06),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1983, 1,   13,   00, 30),//С„РµРІСЂР°Р»СЊ
	new Date(1983, 2,   14,   17, 42),//РјР°СЂС‚
	new Date(1983, 3,   13,   07, 57),//Р°РїСЂРµР»СЊ  
	new Date(1983, 4,   12,   19, 23),//РјР°Р№
	new Date(1983, 5,   11,   04, 36),//РёСЋРЅСЊ
	new Date(1983, 6,   10,   12, 17),//РёСЋР»СЊ
	new Date(1983, 7,   08,   19, 16),//Р°РІРіСѓСЃС‚
	new Date(1983, 8,   07,   02, 34),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1983, 9,   06,   11, 14),//РѕРєС‚СЏР±СЂСЊ
	new Date(1983, 10,  04,   22, 20),//РЅРѕСЏР±СЂСЊ
	new Date(1983, 11,  04,   12, 24),//РґРµРєР°Р±СЂСЊ
//1984
	new Date(1984, 0,   03,   05, 14),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1984, 1,   01,   23, 45),//С„РµРІСЂР°Р»СЊ
	new Date(1984, 2,   02,   18, 29),//РјР°СЂС‚
	new Date(1984, 3,   01,   12, 08),//Р°РїСЂРµР»СЊ  
	new Date(1984, 4,   01,   03, 44),//РјР°Р№
	new Date(1984, 4,   30,   16, 46),//РјР°Р№
	new Date(1984, 5,   29,   03, 17),//РёСЋРЅСЊ
	new Date(1984, 6,   28,   11, 50),//РёСЋР»СЊ
	new Date(1984, 7,   26,   19, 24),//Р°РІРіСѓСЃС‚
	new Date(1984, 8,   25,   03, 09),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1984, 9,   24,   12, 07),//РѕРєС‚СЏР±СЂСЊ
	new Date(1984, 10,  22,   22, 55),//РЅРѕСЏР±СЂСЊ
	new Date(1984, 11,  22,   11, 45),//РґРµРєР°Р±СЂСЊ
//1985
	new Date(1985, 0,   21,   02, 27),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1985, 1,   19,   18, 41),//С„РµРІСЂР°Р»СЊ
	new Date(1985, 2,   21,   11, 57),//РјР°СЂС‚
	new Date(1985, 3,   20,   05, 21),//Р°РїСЂРµР»СЊ  
	new Date(1985, 4,   19,   21, 40),//РјР°Р№
	new Date(1985, 5,   18,   11, 57),//РёСЋРЅСЊ
	new Date(1985, 6,   17,   23, 55),//РёСЋР»СЊ
	new Date(1985, 7,   16,   10, 04),//Р°РІРіСѓСЃС‚
	new Date(1985, 8,   14,   19, 19),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1985, 9,   14,   04, 32),//РѕРєС‚СЏР±СЂСЊ
	new Date(1985, 10,  12,   14, 19),//РЅРѕСЏР±СЂСЊ
	new Date(1985, 11,  12,   00, 53),//РґРµРєР°Р±СЂСЊ
//1986
	new Date(1986, 0,   10,   12, 20),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1986, 1,   09,   00, 54),//С„РµРІСЂР°Р»СЊ
	new Date(1986, 2,   10,   14, 50),//РјР°СЂС‚
	new Date(1986, 3,   09,   06, 07),//Р°РїСЂРµР»СЊ  
	new Date(1986, 4,   08,   22, 08),//РјР°Р№
	new Date(1986, 5,   07,   13, 59),//РёСЋРЅСЊ
	new Date(1986, 6,   07,   04, 53),//РёСЋР»СЊ
	new Date(1986, 7,   05,   18, 34),//Р°РІРіСѓСЃС‚
	new Date(1986, 8,   04,   07, 09),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1986, 9,   03,   18, 53),//РѕРєС‚СЏР±СЂСЊ
	new Date(1986, 10,  02,   06, 01),//РЅРѕСЏР±СЂСЊ
	new Date(1986, 11,  01,   16, 41),//РґРµРєР°Р±СЂСЊ
	new Date(1986, 11,  31,   03, 08),//РґРµРєР°Р±СЂСЊ!!!!!!!!!
//1987
	new Date(1987, 0,   29,   13, 43),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1987, 1,   28,   00, 49),//С„РµРІСЂР°Р»СЊ
	new Date(1987, 2,   29,   12, 44),//РјР°СЂС‚
	new Date(1987, 3,   28,   01, 33),//Р°РїСЂРµР»СЊ  
	new Date(1987, 4,   27,   15, 12),//РјР°Р№
	new Date(1987, 5,   26,   05, 35),//РёСЋРЅСЊ
	new Date(1987, 6,   25,   20, 36),//РёСЋР»СЊ
	new Date(1987, 7,   24,   11, 57),//Р°РІРіСѓСЃС‚
	new Date(1987, 8,   23,   03, 07),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1987, 9,   22,   17, 26),//РѕРєС‚СЏР±СЂСЊ
	new Date(1987, 10,  21,   06, 31),//РЅРѕСЏР±СЂСЊ
	new Date(1987, 11,  20,   18, 24),//РґРµРєР°Р±СЂСЊ
//1988
	new Date(1988, 0,   19,   05, 24),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1988, 1,   17,   15, 53),//С„РµРІСЂР°Р»СЊ
	new Date(1988, 2,   18,   02, 01),//РјР°СЂС‚
	new Date(1988, 3,   16,   11, 58),//Р°РїСЂРµР»СЊ  
	new Date(1988, 4,   15,   22, 09),//РјР°Р№
	new Date(1988, 5,   14,   09, 12),//РёСЋРЅСЊ
	new Date(1988, 6,   13,   21, 51),//РёСЋР»СЊ
	new Date(1988, 7,   12,   12, 30),//Р°РІРіСѓСЃС‚
	new Date(1988, 8,   11,   04, 48),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1988, 9,   10,   21, 47),//РѕРєС‚СЏР±СЂСЊ
	new Date(1988, 10,  09,   14, 18),//РЅРѕСЏР±СЂСЊ
	new Date(1988, 11,  09,   05, 35),//РґРµРєР°Р±СЂСЊ
//1989
	new Date(1989, 0,   07,   19, 21),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1989, 1,   06,   07, 35),//С„РµРІСЂР°Р»СЊ
	new Date(1989, 2,   07,   18, 17),//РјР°СЂС‚
	new Date(1989, 3,   06,   03, 31),//Р°РїСЂРµР»СЊ  
	new Date(1989, 4,   05,   11, 45),//РјР°Р№
	new Date(1989, 5,   03,   19, 51),//РёСЋРЅСЊ
	new Date(1989, 6,   03,   04, 58),//РёСЋР»СЊ
	new Date(1989, 7,   01,   16, 04),//Р°РІРіСѓСЃС‚
	new Date(1989, 7,   31,   05, 43),//Р°РІРіСѓСЃС‚!!!!!
	new Date(1989, 8,   29,   21, 46),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1989, 9,   29,   15, 26),//РѕРєС‚СЏР±СЂСЊ
	new Date(1989, 10,  28,   09, 39),//РЅРѕСЏР±СЂСЊ
	new Date(1989, 11,  28,   03, 18),//РґРµРєР°Р±СЂСЊ
//1990
	new Date(1990, 0,   26,   19, 19),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1990, 1,   25,   08, 53),//С„РµРІСЂР°Р»СЊ
	new Date(1990, 2,   26,   19, 47),//РјР°СЂС‚
	new Date(1990, 3,   25,   04, 26),//Р°РїСЂРµР»СЊ  
	new Date(1990, 4,   24,   11, 45),//РјР°Р№
	new Date(1990, 5,   22,   18, 53),//РёСЋРЅСЊ
	new Date(1990, 6,   22,   02, 53),//РёСЋР»СЊ
	new Date(1990, 7,   20,   12, 37),//Р°РІРіСѓСЃС‚
	new Date(1990, 8,   19,   00, 45),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1990, 9,   18,   15, 35),//РѕРєС‚СЏР±СЂСЊ
	new Date(1990, 10,  17,   09, 03),//РЅРѕСЏР±СЂСЊ
	new Date(1990, 11,  17,   04, 20),//РґРµРєР°Р±СЂСЊ
//1991
	new Date(1991, 0,   15,   23, 48),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1991, 1,   14,   17, 30),//С„РµРІСЂР°Р»СЊ
	new Date(1991, 2,   16,   08, 09),//РјР°СЂС‚
	new Date(1991, 3,   14,   19, 36),//Р°РїСЂРµР»СЊ  
	new Date(1991, 4,   14,   04, 34),//РјР°Р№
	new Date(1991, 5,   12,   12, 04),//РёСЋРЅСЊ
	new Date(1991, 6,   11,   19, 04),//РёСЋР»СЊ
	new Date(1991, 7,   10,   02, 26),//Р°РІРіСѓСЃС‚
	new Date(1991, 8,   08,   10, 59),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1991, 9,   07,   21, 37),//РѕРєС‚СЏР±СЂСЊ
	new Date(1991, 10,  06,   11, 09),//РЅРѕСЏР±СЂСЊ
	new Date(1991, 11,  06,   03, 55),//РґРµРєР°Р±СЂСЊ
//1992
	new Date(1992, 0,   04,   23, 08),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1992, 1,   03,   18, 58),//С„РµРІСЂР°Р»СЊ
	new Date(1992, 2,   04,   13, 21),//РјР°СЂС‚
	new Date(1992, 3,   03,   05, 00),//Р°РїСЂРµР»СЊ  
	new Date(1992, 4,   02,   17, 43),//РјР°Р№
	new Date(1992, 5,   01,   03, 55),//РёСЋРЅСЊ
	new Date(1992, 5,   30,   12, 16),//РёСЋРЅСЊ!!!!!!!!!!
	new Date(1992, 6,   29,   19, 33),//РёСЋР»СЊ
	new Date(1992, 7,   28,   02, 40),//Р°РІРіСѓСЃС‚
	new Date(1992, 8,   26,   10, 39),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1992, 9,   25,   20, 32),//РѕРєС‚СЏР±СЂСЊ
	new Date(1992, 10,  24,   09, 10),//РЅРѕСЏР±СЂСЊ
	new Date(1992, 11,  24,   00, 42),//РґРµРєР°Р±СЂСЊ
//1993
	new Date(1993, 0,   22,   18, 25),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1993, 1,   21,   13, 04),//С„РµРІСЂР°Р»СЊ
	new Date(1993, 2,   23,   07, 13),//РјР°СЂС‚
	new Date(1993, 3,   21,   23, 48),//Р°РїСЂРµР»СЊ  
	new Date(1993, 4,   21,   14, 05),//РјР°Р№
	new Date(1993, 5,   20,   01, 51),//РёСЋРЅСЊ
	new Date(1993, 6,   19,   11, 23),//РёСЋР»СЊ
	new Date(1993, 7,   17,   19, 27),//Р°РІРіСѓСЃС‚
	new Date(1993, 8,   16,   03, 09),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1993, 9,   15,   11, 34),//РѕРєС‚СЏР±СЂСЊ
	new Date(1993, 10,  13,   21, 33),//РЅРѕСЏР±СЂСЊ
	new Date(1993, 11,  13,   09, 25),//РґРµРєР°Р±СЂСЊ
//1994
	new Date(1994, 0,   11,   23, 09),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1994, 1,   10,   14, 28),//С„РµРІСЂР°Р»СЊ
	new Date(1994, 2,   12,   07, 03),//РјР°СЂС‚
	new Date(1994, 3,   11,   00, 16),//Р°РїСЂРµР»СЊ  
	new Date(1994, 4,   10,   17, 05),//РјР°Р№
	new Date(1994, 5,   09,   08, 25),//РёСЋРЅСЊ
	new Date(1994, 6,   08,   21, 36),//РёСЋР»СЊ
	new Date(1994, 7,   07,   08, 44),//Р°РІРіСѓСЃС‚
	new Date(1994, 8,   05,   18, 31),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1994, 9,   05,   03, 32),//РѕРєС‚СЏР±СЂСЊ
	new Date(1994, 10,  03,   13, 34),//РЅРѕСЏР±СЂСЊ
	new Date(1994, 11,  02,   23, 52),//РґРµРєР°Р±СЂСЊ
//1995
	new Date(1995, 0,   01,   10, 54),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1995, 0,   30,   22, 46),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1995, 2,   01,   11, 46),//С„РµРІСЂР°Р»СЊ
	new Date(1995, 2,   31,   02, 07),//РјР°СЂС‚
	new Date(1995, 3,   29,   17, 35),//Р°РїСЂРµР»СЊ  
	new Date(1995, 4,   29,   09, 26),//РјР°Р№
	new Date(1995, 5,   28,   00, 49),//РёСЋРЅСЊ
	new Date(1995, 6,   27,   15, 12),//РёСЋР»СЊ
	new Date(1995, 7,   26,   04, 30),//Р°РІРіСѓСЃС‚
	new Date(1995, 8,   24,   16, 53),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1995, 9,   24,   04, 35),//РѕРєС‚СЏР±СЂСЊ
	new Date(1995, 10,  22,   15, 41),//РЅРѕСЏР±СЂСЊ
	new Date(1995, 11,  22,   02, 21),//РґРµРєР°Р±СЂСЊ
//1996
	new Date(1996, 0,   20,   12, 49),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1996, 1,   18,   23, 29),//С„РµРІСЂР°Р»СЊ
	new Date(1996, 2,   19,   10, 43),//РјР°СЂС‚
	new Date(1996, 3,   17,   22, 47),//Р°РїСЂРµР»СЊ  
	new Date(1996, 4,   17,   11, 45),//РјР°Р№
	new Date(1996, 5,   16,   01, 34),//РёСЋРЅСЊ
	new Date(1996, 6,   15,   16, 14),//РёСЋР»СЊ
	new Date(1996, 7,   14,   07, 33),//Р°РІРіСѓСЃС‚
	new Date(1996, 8,   12,   23, 06),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1996, 9,   12,   14, 13),//РѕРєС‚СЏР±СЂСЊ
	new Date(1996, 10,  11,   04, 15),//РЅРѕСЏР±СЂСЊ
	new Date(1996, 11,  10,   16, 55),//РґРµРєР°Р±СЂСЊ
//1997
	new Date(1997, 0,   09,   04, 24),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1997, 1,   07,   15, 05),//С„РµРІСЂР°Р»СЊ
	new Date(1997, 2,   09,   01, 13),//РјР°СЂС‚
	new Date(1997, 3,   07,   11, 00),//Р°РїСЂРµР»СЊ  
	new Date(1997, 4,   06,   20, 45),//РјР°Р№
	new Date(1997, 5,   05,   07, 02),//РёСЋРЅСЊ
	new Date(1997, 6,   04,   18, 38),//РёСЋР»СЊ
	new Date(1997, 7,   03,   08, 13),//Р°РІРіСѓСЃС‚
	new Date(1997, 8,   01,   23, 51),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1997, 9,   01,   16, 50),//РѕРєС‚СЏР±СЂСЊ
	new Date(1997, 9,   31,   10, 00),//РѕРєС‚СЏР±СЂСЊ
	new Date(1997, 10,  30,   02, 13),//РЅРѕСЏР±СЂСЊ
	new Date(1997, 11,  29,   16, 55),//РґРµРєР°Р±СЂСЊ
//1998
	new Date(1998, 0,   28,   05, 59),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1998, 1,   26,   17, 25),//С„РµРІСЂР°Р»СЊ
	new Date(1998, 2,   28,   03, 12),//РјР°СЂС‚
	new Date(1998, 3,   26,   11, 40),//Р°РїСЂРµР»СЊ  
	new Date(1998, 4,   25,   19, 31),//РјР°Р№
	new Date(1998, 5,   24,   03, 49),//РёСЋРЅСЊ
	new Date(1998, 6,   23,   13, 42),//РёСЋР»СЊ
	new Date(1998, 7,   22,   02, 02),//Р°РІРіСѓСЃС‚
	new Date(1998, 8,   20,   17, 00),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1998, 9,   20,   10, 08),//РѕРєС‚СЏР±СЂСЊ
	new Date(1998, 10,  19,   04, 25),//РЅРѕСЏР±СЂСЊ
	new Date(1998, 11,  18,   22, 41),//РґРµРєР°Р±СЂСЊ
//1999
	new Date(1999, 0,   17,   15, 45),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(1999, 1,   16,   06, 37),//С„РµРІСЂР°Р»СЊ
	new Date(1999, 2,   17,   18, 47),//РјР°СЂС‚
	new Date(1999, 3,   16,   04, 20),//Р°РїСЂРµР»СЊ  
	new Date(1999, 4,   15,   12, 04),//РјР°Р№
	new Date(1999, 5,   13,   19, 01),//РёСЋРЅСЊ
	new Date(1999, 6,   13,   02, 22),//РёСЋР»СЊ
	new Date(1999, 7,   11,   11, 07),//Р°РІРіСѓСЃС‚
	new Date(1999, 8,   09,   22, 01),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(1999, 9,   09,   11, 33),//РѕРєС‚СЏР±СЂСЊ
	new Date(1999, 10,  08,   03, 52),//РЅРѕСЏР±СЂСЊ
	new Date(1999, 11,  07,   22, 30),//РґРµРєР°Р±СЂСЊ
//2000
	new Date(2000, 0,   06,   18, 12),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(2000, 1,   05,   13, 02),//С„РµРІСЂР°Р»СЊ
	new Date(2000, 2,   06,   05, 16),//РјР°СЂС‚
	new Date(2000, 3,   04,   18, 11),//Р°РїСЂРµР»СЊ  
	new Date(2000, 4,   04,   04, 11),//РјР°Р№
	new Date(2000, 5,   02,   12, 13),//РёСЋРЅСЊ
	new Date(2000, 6,   01,   19, 19),//РёСЋР»СЊ!!!!!!!!!!
	new Date(2000, 6,   31,   02, 24),//РёСЋР»СЊ
	new Date(2000, 7,   29,   10, 18),//Р°РІРіСѓСЃС‚
	new Date(2000, 8,   27,   19, 52),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(2000, 9,   27,   07, 57),//РѕРєС‚СЏР±СЂСЊ
	new Date(2000, 10,  25,   23, 10),//РЅРѕСЏР±СЂСЊ
	new Date(2000, 11,  25,   17, 21),//РґРµРєР°Р±СЂСЊ
//2001
	new Date(2001, 0,   24,   13, 05),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(2001, 1,   23,   08, 20),//С„РµРІСЂР°Р»СЊ
	new Date(2001, 2,   25,   01, 20),//РјР°СЂС‚
	new Date(2001, 3,   23,   15, 24),//Р°РїСЂРµР»СЊ  
	new Date(2001, 4,   23,   02, 45),//РјР°Р№
	new Date(2001, 5,   21,   11, 57),//РёСЋРЅСЊ
	new Date(2001, 6,   20,   19, 43),//РёСЋР»СЊ
	new Date(2001, 7,   19,   02, 54),//Р°РІРіСѓСЃС‚
	new Date(2001, 8,   17,   10, 26),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(2001, 9,   16,   19, 22),//РѕРєС‚СЏР±СЂСЊ
	new Date(2001, 10,  15,   06, 39),//РЅРѕСЏР±СЂСЊ
	new Date(2001, 11,  14,   20, 46),//РґРµРєР°Р±СЂСЊ
//2002
	new Date(2002, 0,   13,   13, 27),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(2002, 1,   12,   07, 39),//С„РµРІСЂР°Р»СЊ
	new Date(2002, 2,   14,   02, 01),//РјР°СЂС‚
	new Date(2002, 3,   12,   19, 20),//Р°РїСЂРµР»СЊ  
	new Date(2002, 4,   12,   10, 44),//РјР°Р№
	new Date(2002, 5,   10,   23, 45),//РёСЋРЅСЊ
	new Date(2002, 6,   10,   10, 24),//РёСЋР»СЊ
	new Date(2002, 7,   08,   19, 14),//Р°РІРіСѓСЃС‚
	new Date(2002, 8,   07,   03, 09),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(2002, 9,   06,   11, 16),//РѕРєС‚СЏР±СЂСЊ
	new Date(2002, 10,  04,   20, 33),//РЅРѕСЏР±СЂСЊ
	new Date(2002, 11,  04,   7, 33),//РґРµРєР°Р±СЂСЊ
//2003
	new Date(2003, 0,   02,   20, 21),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(2003, 1,   01,   10, 47),//С„РµРІСЂР°Р»СЊ
	new Date(2003, 2,   03,   02, 33),//РјР°СЂС‚
	new Date(2003, 3,   01,   19, 17),//Р°РїСЂРµР»СЊ  
	new Date(2003, 4,   01,   12, 13),//РјР°Р№
	new Date(2003, 4,   31,   04, 18),//РјР°Р№!!!!!!!!!
	new Date(2003, 5,   29,   18, 37),//РёСЋРЅСЊ
	new Date(2003, 6,   29,   06, 51),//РёСЋР»СЊ
	new Date(2003, 7,   27,   17, 25),//Р°РІРіСѓСЃС‚
	new Date(2003, 8,   26,   03, 08),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(2003, 9,   25,   12, 49),//РѕРєС‚СЏР±СЂСЊ
	new Date(2003, 10,  23,   22, 57),//РЅРѕСЏР±СЂСЊ
	new Date(2003, 11,  23,   09, 42),//РґРµРєР°Р±СЂСЊ
//2004
	new Date(2004, 0,   21,   21, 03),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(2004, 1,   20,   09, 16),//С„РµРІСЂР°Р»СЊ
	new Date(2004, 2,   20,   22, 40),//РјР°СЂС‚
	new Date(2004, 3,   19,   13, 20),//Р°РїСЂРµР»СЊ  
	new Date(2004, 4,   19,   04, 50),//РјР°Р№
	new Date(2004, 5,   17,   20, 25),//РёСЋРЅСЊ
	new Date(2004, 6,   17,   11, 22),//РёСЋР»СЊ
	new Date(2004, 7,   16,   01, 22),//Р°РІРіСѓСЃС‚
	new Date(2004, 8,   14,   14, 28),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(2004, 9,   14,   02, 47),//РѕРєС‚СЏР±СЂСЊ
	new Date(2004, 10,  12,   14, 26),//РЅРѕСЏР±СЂСЊ
	new Date(2004, 11,  12,   01, 28),//РґРµРєР°Р±СЂСЊ
//2005
	new Date(2005, 0,   10,   12, 01),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(2005, 1,   08,   22, 27),//С„РµРІСЂР°Р»СЊ
	new Date(2005, 2,   10,   09, 09),//РјР°СЂС‚
	new Date(2005, 3,   08,   20, 31),//Р°РїСЂРµР»СЊ  
	new Date(2005, 4,   08,   08, 44),//РјР°Р№
	new Date(2005, 5,   06,   21, 53),//РёСЋРЅСЊ
	new Date(2005, 6,   06,   12,01),//РёСЋР»СЊ
	new Date(2005, 7,   05,   03, 03),//Р°РІРіСѓСЃС‚
	new Date(2005, 8,   03,   18, 44),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(2005, 9,   03,   10, 26),//РѕРєС‚СЏР±СЂСЊ
	new Date(2005, 10,  02,   01, 23),//РЅРѕСЏР±СЂСЊ
	new Date(2005, 11,  01,   14, 59),//РґРµРєР°Р±СЂСЊ
	new Date(2005, 11,  31,   03, 10),//РґРµРєР°Р±СЂСЊ!!!!!!!!!
//2006
	new Date(2006, 0,   29,   14, 13),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(2006, 1,   28,   00, 29),//С„РµРІСЂР°Р»СЊ
	new Date(2006, 2,   29,   10, 14),//РјР°СЂС‚
	new Date(2006, 3,   27,   19, 42),//Р°РїСЂРµР»СЊ  
	new Date(2006, 4,   27,   05, 24),//РјР°Р№
	new Date(2006, 5,   25,   16, 04),//РёСЋРЅСЊ
	new Date(2006, 6,   25,   04, 29),//РёСЋР»СЊ
	new Date(2006, 7,   23,   19, 08),//Р°РІРіСѓСЃС‚
	new Date(2006, 8,   22,   11, 43),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(2006, 9,   22,   05, 12),//РѕРєС‚СЏР±СЂСЊ
	new Date(2006, 10,  20,   22, 16),//РЅРѕСЏР±СЂСЊ
	new Date(2006, 11,  20,   13, 59),//РґРµРєР°Р±СЂСЊ
//2007
	new Date(2007, 0,   19,   03, 59),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(2007, 1,   17,   16, 13),//С„РµРІСЂР°Р»СЊ
	new Date(2007, 2,   19,   02, 41),//РјР°СЂС‚
	new Date(2007, 3,   17,   11, 34),//Р°РїСЂРµР»СЊ  
	new Date(2007, 4,   16,   19, 26),//РјР°Р№
	new Date(2007, 5,   15,   03, 11),//РёСЋРЅСЊ
	new Date(2007, 6,   14,   12, 02),//РёСЋР»СЊ
	new Date(2007, 7,   12,   23, 01),//Р°РІРіСѓСЃС‚
	new Date(2007, 8,   11,   12, 43),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(2007, 9,   11,   04, 59),//РѕРєС‚СЏР±СЂСЊ
	new Date(2007, 10,  09,   23, 01),//РЅРѕСЏР±СЂСЊ
	new Date(2007, 11,  09,   17, 39),//РґРµРєР°Р±СЂСЊ
//2008
	new Date(2008, 0,   08,   11, 35),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(2008, 1,   07,   03, 43),//С„РµРІСЂР°Р»СЊ
	new Date(2008, 2,   07,   17, 13),//РјР°СЂС‚
	new Date(2008, 3,   06,   03, 54),//Р°РїСЂРµР»СЊ  
	new Date(2008, 4,   05,   12, 17),//РјР°Р№
	new Date(2008, 5,   03,   19, 21),//РёСЋРЅСЊ
	new Date(2008, 6,   03,   02, 17),//РёСЋР»СЊ
	new Date(2008, 7,   01,   10, 11),//Р°РІРіСѓСЃС‚
	new Date(2008, 7,   30,   19, 57),//Р°РІРіСѓСЃС‚!!!!!!!!!!
	new Date(2008, 8,   29,   08, 11),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(2008, 9,   28,   23, 12),//РѕРєС‚СЏР±СЂСЊ
	new Date(2008, 10,  27,   16, 53),//РЅРѕСЏР±СЂСЊ
	new Date(2008, 11,  27,   12, 21),//РґРµРєР°Р±СЂСЊ
//2009
	new Date(2009, 0,   26,   07, 54),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(2009, 1,   25,   01, 34),//С„РµРІСЂР°Р»СЊ
	new Date(2009, 2,   26,   16, 05),//РјР°СЂС‚
	new Date(2009, 3,   25,   03, 21),//Р°РїСЂРµР»СЊ  
	new Date(2009, 4,   24,   12, 09),//РјР°Р№
	new Date(2009, 5,   22,   19, 33),//РёСЋРЅСЊ
	new Date(2009, 6,   22,   02, 33),//РёСЋР»СЊ
	new Date(2009, 7,   20,   10, 00),//Р°РІРіСѓСЃС‚
	new Date(2009, 8,   18,   18, 43),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(2009, 9,   18,   05, 31),//РѕРєС‚СЏР±СЂСЊ
	new Date(2009, 10,  16,   19, 12),//РЅРѕСЏР±СЂСЊ
	new Date(2009, 11,  16,   12, 01),//РґРµРєР°Р±СЂСЊ
//2010
	new Date(2010, 0,   15,   07, 10),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(2010, 1,   14,   02, 50),//С„РµРІСЂР°Р»СЊ
	new Date(2010, 2,   15,   21, 00),//РјР°СЂС‚
	new Date(2010, 3,   14,   12, 28),//Р°РїСЂРµР»СЊ  
	new Date(2010, 4,   14,   01, 03),//РјР°Р№
	new Date(2010, 5,   12,   11, 13),//РёСЋРЅСЊ
	new Date(2010, 6,   11,   19, 39),//РёСЋР»СЊ
	new Date(2010, 7,   10,   03, 06),//Р°РІРіСѓСЃС‚
	new Date(2010, 8,   08,   10, 28),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(2010, 9,   07,   18, 43),//РѕРєС‚СЏР±СЂСЊ
	new Date(2010, 10,  06,   04, 50),//РЅРѕСЏР±СЂСЊ
	new Date(2010, 11,  05,   17, 34),//РґРµРєР°Р±СЂСЊ
//2011
	new Date(2011, 0,   04,   09, 01),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(2011, 1,   03,   02, 29),//С„РµРІСЂР°Р»СЊ
	new Date(2011, 2,   04,   20, 44),//РјР°СЂС‚
	new Date(2011, 3,   03,   14, 31),//Р°РїСЂРµР»СЊ  
	new Date(2011, 4,   03,   06, 49),//РјР°Р№
	new Date(2011, 5,   01,   21, 01),//РёСЋРЅСЊ
	new Date(2011, 6,   01,   08, 52),//РёСЋР»СЊ
	new Date(2011, 6,   30,   18, 38),//РёСЋР»СЊ!!!!!!!!!!!
	new Date(2011, 7,   29,   03, 02),//Р°РІРіСѓСЃС‚
	new Date(2011, 8,   27,   11, 07),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(2011, 9,   26,   19, 54),//РѕРєС‚СЏР±СЂСЊ
	new Date(2011, 10,  25,   06, 08),//РЅРѕСЏР±СЂСЊ
	new Date(2011, 11,  24,   18, 05),//РґРµРєР°Р±СЂСЊ
//2012
	new Date(2012, 0,   23,   07, 37),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(2012, 1,   21,   22, 33),//С„РµРІСЂР°Р»СЊ
	new Date(2012, 2,   22,   14, 36),//РјР°СЂС‚
	new Date(2012, 3,   21,   07, 17),//Р°РїСЂРµР»СЊ  
	new Date(2012, 4,   20,   23, 45),//РјР°Р№
	new Date(2012, 5,   19,   15, 01),//РёСЋРЅСЊ
	new Date(2012, 6,   19,   04, 29),//РёСЋР»СЊ
	new Date(2012, 7,   17,   15, 53),//Р°РІРіСѓСЃС‚
	new Date(2012, 8,   16,   02, 09),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(2012, 9,   15,   12, 01),//РѕРєС‚СЏР±СЂСЊ
	new Date(2012, 10,  13,   22, 06),//РЅРѕСЏР±СЂСЊ
	new Date(2012, 11,  13,   08, 40),//РґРµРєР°Р±СЂСЊ
//2013
	new Date(2013, 0,   11,   19, 42),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(2013, 1,   10,   07, 18),//С„РµРІСЂР°Р»СЊ
	new Date(2013, 2,   11,   19, 50),//РјР°СЂС‚
	new Date(2013, 3,   10,   09, 34),//Р°РїСЂРµР»СЊ  
	new Date(2013, 4,   10,   00, 27),//РјР°Р№
	new Date(2013, 5,   08,   15, 55),//РёСЋРЅСЊ
	new Date(2013, 6,   08,   07, 13),//РёСЋР»СЊ
	new Date(2013, 7,   06,   21, 50),//Р°РІРіСѓСЃС‚
	new Date(2013, 8,   05,   11, 35),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(2013, 9,   05,   00, 33),//РѕРєС‚СЏР±СЂСЊ
	new Date(2013, 10,  03,   12, 49),//РЅРѕСЏР±СЂСЊ
	new Date(2013, 11,  03,   00, 21),//РґРµРєР°Р±СЂСЊ
//2014
	new Date(2014, 0,   01,   11, 13),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(2014, 0,   30,   21, 37),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ!!!!!
	new Date(2014, 2,   01,   07, 58),//РјР°СЂС‚!!!!!!!!
	new Date(2014, 2,   30,   18, 43),//РјР°СЂС‚
	new Date(2014, 3,   29,   06, 13),//Р°РїСЂРµР»СЊ  
	new Date(2014, 4,   28,   18, 38),//РјР°Р№
	new Date(2014, 5,   27,   08, 07),//РёСЋРЅСЊ
	new Date(2014, 6,   26,   22, 40),//РёСЋР»СЊ
	new Date(2014, 7,   25,   14, 11),//Р°РІРіСѓСЃС‚
	new Date(2014, 8,   24,   06, 12),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(2014, 9,   23,   21, 55),//РѕРєС‚СЏР±СЂСЊ
	new Date(2014, 10,  22,   12, 31),//РЅРѕСЏР±СЂСЊ
	new Date(2014, 11,  22,   01, 34),//РґРµРєР°Р±СЂСЊ
//2015
	new Date(2015, 0,   20,   13, 12),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(2015, 1,   19,   23, 45),//С„РµРІСЂР°Р»СЊ
	new Date(2015, 2,   20,   09, 34),//РјР°СЂС‚
	new Date(2015, 3,   18,   18, 55),//Р°РїСЂРµР»СЊ  
	new Date(2015, 4,   18,   04, 11),//РјР°Р№
	new Date(2015, 5,   16,   14, 03),//РёСЋРЅСЊ
	new Date(2015, 6,   16,   01, 23),//РёСЋР»СЊ
	new Date(2015, 7,   14,   14, 52),//Р°РІРіСѓСЃС‚
	new Date(2015, 8,   13,   06, 40),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(2015, 9,   13,   00, 04),//РѕРєС‚СЏР±СЂСЊ
	new Date(2015, 10,  11,   17, 46),//РЅРѕСЏР±СЂСЊ
	new Date(2015, 11,  11,   10, 28),//РґРµРєР°Р±СЂСЊ
//2016
	new Date(2016, 0,   10,   01, 29),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(2016, 1,   08,   14, 37),//С„РµРІСЂР°Р»СЊ
	new Date(2016, 2,   09,   01, 53),//РјР°СЂС‚
	new Date(2016, 3,   07,   11, 22),//Р°РїСЂРµР»СЊ  
	new Date(2016, 4,   06,   19, 28),//РјР°Р№
	new Date(2016, 5,   05,   02, 58),//РёСЋРЅСЊ
	new Date(2016, 6,   04,   10, 59),//РёСЋР»СЊ
	new Date(2016, 7,   02,   20, 43),//Р°РІРіСѓСЃС‚
	new Date(2016, 8,   01,   09, 02),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(2016, 9,   01,   00, 10),//РѕРєС‚СЏР±СЂСЊ
	new Date(2016, 9,   30,   17, 37),//РѕРєС‚СЏР±СЂСЊ!!!!!!!!!!!!
	new Date(2016, 10,  29,   12, 17),//РЅРѕСЏР±СЂСЊ
	new Date(2016, 11,  29,   06, 52),//РґРµРєР°Р±СЂСЊ
//2017
	new Date(2017, 0,   28,   00, 05),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(2017, 1,   26,   14, 57),//С„РµРІСЂР°Р»СЊ
	new Date(2017, 2,   28,   02, 56),//РјР°СЂС‚
	new Date(2017, 3,   26,   12, 15),//Р°РїСЂРµР»СЊ  
	new Date(2017, 4,   25,   19, 43),//РјР°Р№
	new Date(2017, 5,   24,   02, 29),//РёСЋРЅСЊ
	new Date(2017, 6,   23,   09, 44),//РёСЋР»СЊ
	new Date(2017, 7,   21,   18, 29),//Р°РІРіСѓСЃС‚
	new Date(2017, 8,   20,   05, 28),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(2017, 9,   19,   19, 10),//РѕРєС‚СЏР±СЂСЊ
	new Date(2017, 10,  18,   11, 40),//РЅРѕСЏР±СЂСЊ
	new Date(2017, 11,  18,   06, 29),//РґРµРєР°Р±СЂСЊ
//2018
	new Date(2018, 0,   17,   02, 15),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(2018, 1,   15,   21, 01),//С„РµРІСЂР°Р»СЊ
	new Date(2018, 2,   17,   13, 10),//РјР°СЂС‚
	new Date(2018, 3,   16,   01, 55),//Р°РїСЂРµР»СЊ  
	new Date(2018, 4,   15,   11, 46),//РјР°Р№
	new Date(2018, 5,   13,   19, 41),//РёСЋРЅСЊ
	new Date(2018, 6,   13,   02, 46),//РёСЋР»СЊ
	new Date(2018, 7,   11,   09, 56),//Р°РІРіСѓСЃС‚
	new Date(2018, 8,   09,   18, 00),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(2018, 9,   09,   03, 45),//РѕРєС‚СЏР±СЂСЊ
	new Date(2018, 10,  07,   16, 00),//РЅРѕСЏР±СЂСЊ
	new Date(2018, 11,  07,   07, 19),//РґРµРєР°Р±СЂСЊ
//2019
	new Date(2019, 0,   06,   01, 27),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(2019, 1,   04,   21, 02),//С„РµРІСЂР°Р»СЊ
	new Date(2019, 2,   06,   16, 02),//РјР°СЂС‚
	new Date(2019, 3,   05,   08, 49),//Р°РїСЂРµР»СЊ  
	new Date(2019, 4,   04,   22, 43),//РјР°Р№
	new Date(2019, 5,   03,   10, 00),//РёСЋРЅСЊ
	new Date(2019, 6,   02,   19, 14),//РёСЋР»СЊ
	new Date(2019, 7,   01,   03, 10),//Р°РІРіСѓСЃС‚
	new Date(2019, 7,   30,   10, 35),//Р°РІРіСѓСЃС‚!!!!!!!
	new Date(2019, 8,   28,   18, 24),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(2019, 9,   28,   03, 37),//РѕРєС‚СЏР±СЂСЊ
	new Date(2019, 10,  26,   15, 04),//РЅРѕСЏР±СЂСЊ
	new Date(2019, 11,  26,   05, 11),//РґРµРєР°Р±СЂСЊ
//2020
	new Date(2020, 0,   24,   21, 40),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(2020, 1,   23,   15, 30),//С„РµРІСЂР°Р»СЊ
	new Date(2020, 2,   24,   09, 26),//РјР°СЂС‚
	new Date(2020, 3,   23,   02, 24),//Р°РїСЂРµР»СЊ  
	new Date(2020, 4,   22,   17, 37),//РјР°Р№
	new Date(2020, 5,   21,   06, 39),//РёСЋРЅСЊ
	new Date(2020, 6,   20,   17, 31),//РёСЋР»СЊ
	new Date(2020, 7,   19,   02, 40),//Р°РІРіСѓСЃС‚
	new Date(2020, 8,   17,   10, 58),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(2020, 9,   16,   19, 29),//РѕРєС‚СЏР±СЂСЊ
	new Date(2020, 10,  15,   05, 05),//РЅРѕСЏР±СЂСЊ
	new Date(2020, 11,  14,   16, 15),//РґРµРєР°Р±СЂСЊ
//2021
	new Date(2021, 0,   13,   04, 58),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(2021, 1,   11,   19, 04),//С„РµРІСЂР°Р»СЊ
	new Date(2021, 2,   13,   10, 19),//РјР°СЂС‚
	new Date(2021, 3,   12,   02, 29),//Р°РїСЂРµР»СЊ  
	new Date(2021, 4,   11,   18, 58),//РјР°Р№
	new Date(2021, 5,   10,   10, 51),//РёСЋРЅСЊ
	new Date(2021, 6,   10,   01, 15),//РёСЋР»СЊ
	new Date(2021, 7,   08,   13, 48),//Р°РІРіСѓСЃС‚
	new Date(2021, 8,   07,   00, 50),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(2021, 9,   06,   11, 04),//РѕРєС‚СЏР±СЂСЊ
	new Date(2021, 10,  04,   21, 13),//РЅРѕСЏР±СЂСЊ
	new Date(2021, 11,  04,   07, 41),//РґРµРєР°Р±СЂСЊ
//2022
	new Date(2022, 0,   02,   18, 32),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(2022, 1,   01,   05, 44),//С„РµРІСЂР°Р»СЊ
	new Date(2022, 2,   02,   17, 33),//РјР°СЂС‚
	new Date(2022, 3,   01,   06, 23),//Р°РїСЂРµР»СЊ
	new Date(2022, 3,   30,   20, 26),//Р°РїСЂРµР»СЊ	!!!!!!!!
	new Date(2022, 4,   30,   11, 28),//РјР°Р№
	new Date(2022, 5,   29,   02, 50),//РёСЋРЅСЊ
	new Date(2022, 6,   28,   17, 53),//РёСЋР»СЊ
	new Date(2022, 7,   27,   08, 15),//Р°РІРіСѓСЃС‚
	new Date(2022, 8,   25,   21, 53),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(2022, 9,   25,   10, 47),//РѕРєС‚СЏР±СЂСЊ
	new Date(2022, 10,  23,   22, 55),//РЅРѕСЏР±СЂСЊ
	new Date(2022, 11,  23,   10, 15),//РґРµРєР°Р±СЂСЊ
//2023
	new Date(2023, 0,   21,   20, 51),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(2023, 1,   20,   07, 04),//С„РµРІСЂР°Р»СЊ
	new Date(2023, 2,   21,   17, 21),//РјР°СЂС‚
	new Date(2023, 3,   20,   04, 11),//Р°РїСЂРµР»СЊ  
	new Date(2023, 4,   19,   15, 51),//РјР°Р№
	new Date(2023, 5,   18,   04, 35),//РёСЋРЅСЊ
	new Date(2023, 6,   17,   18, 30),//РёСЋР»СЊ
	new Date(2023, 7,   08,   09, 36),//Р°РІРіСѓСЃС‚
	new Date(2023, 8,   07,   01, 38),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(2023, 9,   06,   17, 53),//РѕРєС‚СЏР±СЂСЊ
	new Date(2023, 10,  04,   09, 25),//РЅРѕСЏР±СЂСЊ
	new Date(2023, 11,  04,   23, 30),//РґРµРєР°Р±СЂСЊ
//2024
	new Date(2024, 0,   11,   11, 55),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(2024, 1,   09,   22, 57),//С„РµРІСЂР°Р»СЊ
	new Date(2024, 2,   10,   08, 59),//РјР°СЂС‚
	new Date(2024, 3,   08,   18, 19),//Р°РїСЂРµР»СЊ  
	new Date(2024, 4,   08,   03, 20),//РјР°Р№
	new Date(2024, 5,   06,   12, 36),//РёСЋРЅСЊ
	new Date(2024, 6,   06,   22, 55),//РёСЋР»СЊ
	new Date(2024, 7,   05,   11, 11),//Р°РІРіСѓСЃС‚
	new Date(2024, 8,   04,   01, 54),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(2024, 9,   03,   18, 47),//РѕРєС‚СЏР±СЂСЊ
	new Date(2024, 10,  02,   12, 45),//РЅРѕСЏР±СЂСЊ
	new Date(2024, 11,  01,   06, 20),//РґРµРєР°Р±СЂСЊ
	new Date(2024, 11,  30,   22, 25),//РґРµРєР°Р±СЂСЊ!!!!!!!!!!
//2025
	new Date(2025, 0,   29,   12, 34),//РіРѕРґ РјРµСЃСЏС† РґРµРЅСЊ С‡Р°СЃ РјРёРЅ СЏРЅРІР°СЂСЊ
	new Date(2025, 1,   28,   00, 45),//С„РµРІСЂР°Р»СЊ
	new Date(2025, 2,   29,   10, 56),//РјР°СЂС‚
	new Date(2025, 3,   27,   19, 29),//Р°РїСЂРµР»СЊ  
	new Date(2025, 4,   27,   03, 00),//РјР°Р№
	new Date(2025, 5,   25,   10, 30),//РёСЋРЅСЊ
	new Date(2025, 6,   24,   19, 09),//РёСЋР»СЊ
	new Date(2025, 7,   23,   06, 05),//Р°РІРіСѓСЃС‚
	new Date(2025, 8,   21,   19, 52),//СЃРµРЅС‚СЏР±СЂСЊ
	new Date(2025, 9,   21,   12, 23),//РѕРєС‚СЏР±СЂСЊ
	new Date(2025, 10,  20,   06, 45),//РЅРѕСЏР±СЂСЊ
	new Date(2025, 11,  20,   01, 41)//РґРµРєР°Р±СЂСЊ
];

i=0;
var Mi = date.getMinutes();
var H = date.getHours();
var D = date.getDate();
var M = date.getMonth();
var Y = date.getFullYear();
dateU = new Date(Y, M, D, H-UTC, Mi);
while (NM_date[i].getTime() < dateU.getTime())
{
i=i+1;		
};
var NM_Day = NM_date[i-1].getDate();
var NM_Month = NM_date[i-1].getMonth();
var NM_Year = NM_date[i-1].getFullYear();
var NM_Hour = NM_date[i-1].getHours();
var NM_Min = NM_date[i-1].getMinutes();		
NM = new Date(NM_Year, NM_Month, NM_Day, NM_Hour + UTC, NM_Min, 0,0);
return (NM);

}